[
  {
    "image_path": "test_images\\1107_0.webp",
    "analysis": "**Advice for Passion Fruit Farmers: Dealing with Passion Fruit Brown Spot**\n\n**1. What is the Problem?**\n\nThe problem shown in the picture is **Passion Fruit Brown Spot**.  It's a disease that makes brown or orange-brown spots appear on the passion fruit. These spots are usually round and can be different sizes.  The spots show up on the skin of the fruit itself.  Sometimes, you might also see some purplish areas around the spots.\n\n**2. Why it Happened?**\n\nPassion Fruit Brown Spot is caused by a fungus (a tiny plant that can cause disease).  This fungus loves warm, humid weather and thrives when there's not enough air circulation around the plants.  It spreads easily through rain splashes or when the plants touch each other.  You might notice the spots appearing after a period of heavy rain or if your plants are too crowded.\n\n**3. How to Fix It?**\n\nFirst: **Improve air circulation.**  Prune your plants to make sure they're not too crowded.  This lets air move around and dries the fruit quickly, making it harder for the fungus to grow.\n\nSecond: **Clean up fallen fruit and leaves.**  Remove any fruit that has fallen to the ground or shows signs of the disease.  Also, clear away any dead leaves.  This reduces the amount of fungus that can spread.\n\nThird: **Treat the affected fruits (if possible).**  If the spots are small and only on a few fruits, you might be able to save them.  However, severely affected fruits should be removed and destroyed.\n\n**4. How to Prevent it Next Time?**\n\n* **Plant spacing:** Give your passion fruit plants enough space to grow and breathe.\n* **Pruning:** Regularly prune your plants to improve air circulation.\n* **Watering:** Water your plants at the base, avoiding getting the leaves wet.\n* **Rotation:** Rotate your crops every few years to prevent the build-up of the fungus in the soil.\n* **Watch for warning signs:** Keep a close eye on your plants, especially after rain.  If you see even a few spots, take action immediately.\n\n**5. Treatment Options:**\n\n* **Copper-based fungicides:** These are common and relatively inexpensive.  You can find them at agricultural supply stores.  Look for products containing copper oxychloride.  (Cost: ₹50-₹200 per 100g, depending on brand and quantity).  *Always follow the instructions on the label carefully.*\n* **Natural remedies:** Some farmers use a mixture of cow dung and water as a natural fungicide.  (Cost: negligible).  The effectiveness can vary.\n\n**Instructions for using Copper-based fungicides:**\n\n1. Mix the fungicide with water according to the instructions on the label.\n2. Spray the mixture evenly on the plants, ensuring all parts are covered.\n3. Repeat the spraying every 7-10 days, or as directed on the label.\n\n**Safety Note:** Always wear protective clothing (gloves, mask) when handling and spraying any fungicide.\n\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):**  Contact your local KVK for advice and information.  You can usually find their contact details online or through your local agricultural department.\n* **Government help:**  Inquire about government subsidies or schemes available for purchasing agricultural inputs, including fungicides.  Your local agricultural officer can provide information on this.\n* **Local agriculture officer:**  Contact your local agricultural officer for personalized advice and assistance.\n* **Authorized shops:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "brown spot"
  },
  {
    "image_path": "test_images\\5602588.jpg",
    "analysis": "**Advice for Farmers: Dealing with Cucumber Downy Mildew**\n\n**1. What is the Problem?**\n\nThe problem is **Cucumber Downy Mildew**.  It's a disease that makes your cucumbers look sick.  You'll see a fuzzy, grayish-white mold on the leaves and fruits (cucumbers).  The mold might look like a light dusting at first, then it gets thicker.  The cucumbers themselves can become misshapen and covered in the mold.  The leaves might also yellow and wilt.\n\n**2. Why it Happened?**\n\nThis happens because of a tiny fungus that loves damp, cool weather.  It spreads easily through the air, especially if it's humid and rainy.  If your field is crowded, with poor air circulation, it's easier for the fungus to spread.  Think of it like a cold – it spreads easily when people are close together.\n\nSigns you can spot:  The grayish-white mold is the biggest sign.  You might also see yellow spots on the leaves before the mold appears.\n\n\n**3. How to Fix It?**\n\nFirst:  Remove and destroy all the affected cucumbers and leaves.  Don't compost them; throw them away or burn them. This stops the spread.\n\nSecond: Improve air circulation. If your plants are too close together, thin them out to give them more space.  This helps them dry faster after watering or rain.\n\nThird:  Use a treatment (see below).\n\n\n**4. How to Prevent it Next Time?**\n\n* **Plant spacing:** Give your cucumber plants enough space so air can move around them.\n* **Watering:** Water early in the day so the plants have time to dry before nightfall. Avoid overhead watering; water at the base of the plant.\n* **Crop rotation:** Don't plant cucumbers in the same spot every year. Rotate your crops to different areas of your field.\n* **Cleanliness:** Remove any plant debris from your field after harvest to reduce the chances of the fungus surviving.\n* **Watch for warning signs:** Keep an eye out for yellow spots on the leaves and the tell-tale grayish-white mold.\n\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  Mancozeb (local names vary, check with your local supplier).  A 250g pack might cost around ₹100-₹200.  Follow the instructions on the packet carefully.  Always wear gloves and a mask when using chemicals.\n\n* **Natural Treatment:**  A mixture of baking soda (1 teaspoon) and liquid soap (1 teaspoon) in 1 liter of water can sometimes help. Spray this on the plants, making sure to cover all surfaces.  This is a low-cost, less effective option.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):**  Find your nearest KVK by searching online or asking your local agriculture officer.\n* **Government Help:**  Inquire at your local agriculture office about government subsidies or programs for purchasing agricultural medicines.\n* **Local Agriculture Officer:**  Contact your village's agriculture officer for advice and assistance.\n* **Authorized Shops:** Buy medicines only from reputable agricultural input dealers.\n\n\nRemember, early detection and prompt action are key to controlling downy mildew.  Don't hesitate to seek help from your local experts if you need it.\n",
    "label": "mildew"
  },
  {
    "image_path": "test_images\\6f66ee666c3cabc6b2b6331ffd4f12f3.jpeg",
    "analysis": "**Advice for Farmers: Sooty Mold on Citrus**\n\n**1. What is the Problem?**\n\nThe problem is **sooty mold**.  It's like a black, sooty film covering the leaves and sometimes the fruit of your lemon tree. It makes the leaves look dirty and can affect how well the plant grows.  The leaves and fruits are covered with this dark, dusty coating.\n\n**2. Why it Happened?**\n\nSooty mold isn't a disease itself, but a symptom. It grows on the sticky \"honeydew\" left behind by tiny insects like aphids or scale insects.  Think of it like a fungus growing on spilled sugary juice. These insects suck the sap from your lemon tree, leaving behind this sticky mess. The sooty mold then grows on top of it.  You might see these tiny insects crawling on the leaves or branches.\n\n**3. How to Fix It?**\n\nFirst: **Clean the leaves.** Gently wash the leaves with water to remove as much sooty mold as possible.  You can use a soft cloth or sponge.\n\nSecond: **Control the insects.** This is the most important step.  Start with simple methods:\n    * **Check for insects:** Carefully examine the leaves and branches for tiny insects.\n    * **Handpicking:** If there are only a few insects, you can try picking them off by hand.\n    * **Water spray:** A strong spray of water can knock off some insects. Do this regularly, especially in the morning.\n\nThird: **If insects persist:** After trying the simple methods, you may need to use an insecticide.\n\n**4. How to Prevent it Next Time?**\n\n* **Regular inspection:** Check your lemon trees weekly for insects and sooty mold. Early detection is key.\n* **Healthy plants:** Keep your trees healthy by providing enough water and nutrients. Healthy plants are less likely to be attacked by insects.\n* **Pruning:** Remove any dead or damaged branches to improve air circulation and reduce insect hiding places.\n\n**5. Treatment Options:**\n\n* **Insecticides (Chemical):**  Your local agricultural officer can recommend specific insecticides suitable for your area.  Always follow the instructions carefully.  Prices vary greatly depending on the brand and quantity. Expect to pay anywhere from ₹50 to ₹500 per bottle.\n\n* **Natural Insecticides:** Neem oil is a common natural insecticide.  You can find it at local shops.  A small bottle (100ml) might cost around ₹100-₹200.  Dilute it according to the instructions on the bottle before use.  You can also try a solution of soap and water (a few drops of dish soap in a bucket of water) to spray on the plants.\n\n**Instructions for using treatments:** Always wear gloves and protective clothing when using any insecticide. Follow the instructions on the label carefully.  Never mix different insecticides together unless specifically instructed to do so.\n\n**6. Where to Get Help?**\n\n* **Find your local KVK (Krishi Vigyan Kendra):** Ask other farmers or your village leader for the location and contact information.\n* **Government help:** Inquire at your local agricultural office about subsidies or assistance programs for purchasing insecticides.\n* **Local agriculture officer:** They can identify the specific insects and recommend appropriate treatments.\n* **Authorized shops:** Buy insecticides only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "mold"
  },
  {
    "image_path": "test_images\\9820663405_934eaed214_b.jpg",
    "analysis": "**Advice for Mango Anthracnose**\n\n**1. What is the Problem?**\n\nThe problem is **Mango Anthracnose**, a common disease that affects mangoes.  It looks like brown or black spots, sometimes sunken, appearing on the mango skin.  These spots can grow bigger and may even cause the fruit to rot.  The skin of the mango is mainly affected, but the disease can also spread to the flesh if left untreated.\n\n**2. Why it Happened?**\n\nMango Anthracnose is caused by a fungus (a tiny plant that causes disease) that spreads easily in warm, humid weather, especially during rainy seasons.  The fungus loves damp conditions and can survive on fallen leaves and infected fruits.  You might see signs like small, dark spots appearing on the mangoes, which gradually enlarge and darken.  If you notice many mangoes with these spots on your trees, it's a clear sign of Anthracnose.  Think of it like a cold spreading through a crowded classroom – the more humid and damp the environment, the easier it spreads.\n\n**3. How to Fix It?**\n\nFirst: **Collect and destroy** all fallen and infected mangoes.  Burn them or bury them deeply to stop the fungus from spreading.\n\nSecond: **Clean your orchard**. Remove any dead leaves and branches from around your mango trees.  This reduces the places where the fungus can hide.\n\nThird: **Treat the remaining mangoes**. (See Treatment Options below).\n\n**4. How to Prevent it Next Time?**\n\n* **Proper pruning:** Regularly prune your mango trees to improve air circulation and reduce humidity around the fruits. This helps to prevent the fungus from thriving.\n* **Sanitation:** Regularly clean up fallen leaves and fruits.\n* **Watering:** Avoid overhead watering, which keeps the leaves wet for longer periods, creating a favorable environment for the fungus. Water at the base of the tree instead.\n* **Watch for warning signs:** Keep a close eye on your mango trees during the rainy season. Look for small spots on the fruits and leaves.  Early detection is key!\n\n**5. Treatment Options:**\n\n* **Copper oxychloride:** (Local names may vary – ask your local agricultural officer). This is a common fungicide.  A typical application might cost around ₹100-₹200 per treatment, depending on the size of your orchard and the concentration used.  Always follow the instructions on the label carefully.\n* **Mancozeb:** Another common fungicide, similar in cost and application to copper oxychloride.  (₹100-₹200 per treatment).\n* **Natural remedies:** Some farmers use a mixture of neem oil and water as a natural fungicide.  While it may not be as effective as chemical treatments, it's a safer option.  Neem oil is relatively inexpensive, costing around ₹50-₹150 per litre, depending on the quality.\n\n**Instructions for using treatments:**  Always wear protective clothing (gloves, mask) when applying any fungicide. Mix the fungicide according to the label instructions. Apply evenly to the affected mangoes and surrounding leaves. Repeat the treatment every 7-10 days, as needed, or as per the product instructions.\n\n**Safety Note:**  Always follow the safety instructions on the pesticide label.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local village leader. They can provide expert advice and guidance.\n* **Government help:**  Many government schemes offer subsidies on agricultural inputs, including fungicides.  Inquire at your local agricultural office about these schemes.\n* **Local agriculture officer:** Your local agricultural officer can identify the problem accurately and recommend the best course of action.  They can also help you source genuine medicines.\n* **Authorized shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\apple-scab-apple-4.jpg",
    "analysis": "**Advice for Farmers: Apple Scab**\n\n**1. What is the Problem?**\n\nYour apple fruits have **Apple Scab**.  It's a disease that makes dark, scabby spots appear on the apples.  These spots can be small or large, and they're usually brown or black.  The spots are mostly on the skin of the apple, but sometimes they can affect the fruit's flesh too.  The leaves can also have similar spots.\n\n**2. Why it Happened?**\n\nApple scab is caused by a fungus (a tiny plant that lives on the apple tree) that loves damp, cool weather.  It spreads easily through rain or wind.  If your orchard is shady or poorly ventilated, it's more likely to happen.  You might notice the spots appearing after periods of rain or high humidity.  Think of it like a mold growing on the apples when it's wet for a long time.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy all affected apples and leaves.  Don't compost them; bury them deeply or burn them to stop the fungus from spreading.\n* **Second:** Improve air circulation in your orchard.  Prune branches to let sunlight and air reach all parts of the tree.  This helps the apples dry quickly after rain.\n* **Third:**  If the problem is widespread, consider a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your trees regularly for any signs of spots on apples or leaves.  Early detection is key.\n* **Warning Signs:** Look for dark, scabby spots, especially after rainy periods.  If you see even a few spots, take action immediately.\n* **Preventative Measures:** Plant apple varieties that are resistant to scab.  Make sure your orchard has good drainage to avoid waterlogging.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  Several fungicides are available.  Ask your local agriculture officer for recommendations and the appropriate dosage.  *Always follow the instructions carefully.*  (The cost will vary depending on the product and quantity; expect to pay anywhere from ₹100 to ₹500 per application, depending on the size of your orchard).  *Examples of fungicides (local names may vary)*:  Copper oxychloride, Mancozeb.\n\n* **Natural Treatment:**  Some farmers use a mixture of baking soda and water (a few tablespoons of baking soda in a bucket of water) as a spray.  This is a less effective treatment but may help with mild infections.  It's inexpensive, costing less than ₹20 per application.  *Note:*  This may not be as effective as chemical treatments.\n\n**Important Note:**  Always use protective gear (gloves, mask) when handling any chemical treatment.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your village head.\n* **Government Help:**  Inquire at your local agriculture office about subsidies or assistance programs for purchasing agricultural medicines.\n* **Local Agriculture Officer:**  Contact your local agriculture officer for advice and recommendations.\n* **Genuine Medicines:** Buy medicines only from authorized agricultural input dealers or shops.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\black-knot-disease.jpg",
    "analysis": "This looks like **Black Knot disease**.  It's a fungal infection.\n\n**1. What is the Problem?**\n\nThis disease makes bumpy, black, hard growths (like knots) appear on the branches of your fruit trees (especially plums, cherries, and apricots).  These knots can be small at first, but they grow bigger over time.  They start out greenish, then turn dark brown or black and feel hard and woody.  The branches become deformed and may eventually die.\n\n**2. Why it Happened?**\n\nBlack knot is caused by a fungus that lives in the branches.  It spreads through spores (tiny seeds of the fungus) carried by wind and rain.  The fungus enters the tree through wounds – even tiny scratches or cuts on the branches.  Wounds from pruning, insect damage, or even hail can be entry points.  Wet, humid weather helps the fungus grow.  You might notice the disease more after a rainy season.\n\n**3. How to Fix It?**\n\n* **First:**  Carefully prune out all the infected branches. Cut at least 10-15 cm (4-6 inches) below the knot.  Make clean cuts with sharp, disinfected pruning shears (clean them with rubbing alcohol between cuts).\n* **Second:** Collect and burn or bury the infected branches deeply to prevent the fungus from spreading. Do not compost them.\n* **Third:**  Monitor your trees regularly for new growths.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Regularly inspect your trees for any signs of disease or damage.\n* **Pruning:** Prune your trees during the dormant season (winter) to improve air circulation and reduce humidity.  Make clean cuts to prevent wounds.\n* **Warning Signs:** Watch for small, slightly swollen areas on branches in spring.  These are early signs of the disease.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment (Use only if absolutely necessary and follow instructions carefully):**  Copper-based fungicides (like Copper Oxychloride) are sometimes used.  These can cost around ₹100-₹300 per litre, depending on the brand and quantity.  Always follow the instructions on the label carefully.  **Note:**  Copper can build up in the soil over time, so use it sparingly.\n\n* **Natural Treatment:**  Some farmers report success with applying neem oil (₹50-₹150 per litre) to the affected areas, but it's not always effective against established infections.  It's best used as a preventative measure.\n\n**Instructions for using treatments:**  Always wear gloves and protective clothing when handling any chemicals.  Mix the chemicals according to the label instructions.  Apply the treatment evenly to the affected areas.\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking at your local agricultural office.\n* **Government Help:**  Many state governments offer subsidies on agricultural inputs, including fungicides.  Check with your local agricultural department for details.\n* **Local Agriculture Officer:**  Your local agricultural officer can provide specific advice and guidance.\n* **Genuine Medicines:**  Buy medicines only from authorized agricultural supply stores.\n\n\n**Safety Note:**  *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\download (1).jpeg",
    "analysis": "**Strawberry Gray Mold (Botrytis)**\n\n**1. What is the Problem?**\n\nYour strawberries have gray mold.  It looks like a fuzzy, gray or brown mold growing on the strawberries and sometimes the leaves.  The mold often starts on damaged or rotting fruit and spreads quickly, making the strawberries soft, mushy, and inedible.  The affected parts of the plant are mostly the fruits, but it can also affect flowers and leaves.\n\n**2. Why it Happened?**\n\nGray mold happens because of a fungus (like a tiny plant that causes disease) that loves damp, humid conditions.  Think of it like this: if your clothes stay wet for too long, they get moldy.  The same thing happens to strawberries.  Too much rain, poor air circulation (plants too crowded), and keeping the strawberries wet after watering or rain creates the perfect environment for this fungus to grow.  You might see some brown spots on the strawberries before the gray fuzz appears – that's an early warning sign.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy ALL affected strawberries and leaves. Don't compost them, as the fungus can survive.  Burn them or bury them deep.\n* **Second:** Improve air circulation.  Thin out your strawberry plants if they are too crowded. This lets air move around and dry the plants faster.\n* **Third:** Avoid overhead watering. Water the plants at the base to keep the leaves and fruits dry.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Check your plants regularly for any signs of disease (brown spots, gray fuzz). Remove affected parts immediately.\n* **Warning Signs:** Brown spots on strawberries, high humidity, and wet leaves after rain or watering.\n\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  A solution of baking soda (bicarbonate of soda) and water can help. Mix 1 teaspoon of baking soda in 1 litre of water and spray on the plants.  (Cost: ₹5-10)\n* **Chemical Treatment (Use only if natural treatments fail and follow instructions carefully):**  There are many fungicides available, but you MUST consult your local agriculture officer to choose the right one for your area and follow the instructions precisely.  Examples include those containing  *iprodione* or *pyraclostrobin* (but local names and costs vary greatly – ask your officer).  (Cost: ₹100-500 per application, depending on the product and quantity).\n\n**Safety Note:** Always wear gloves and protective clothing when handling any chemicals.\n\n**6. Where to Get Help?**\n\n* **Find your nearest Krishi Vigyan Kendra (KVK):** Search online for \"KVK [your district name]\" to find their location and contact information.\n* **Government Help:**  Inquire at your KVK or local agriculture office about government subsidies or schemes for purchasing agricultural inputs, including fungicides.\n* **Local Agriculture Officer:** Ask your village head or local agricultural department for the contact details of your local agriculture officer.\n* **Buy medicines from:** Authorized agricultural input dealers or shops.  Avoid buying from unknown sources.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n",
    "label": "mold"
  },
  {
    "image_path": "test_images\\download (3).jpeg",
    "analysis": "I cannot provide advice on the cultivation or treatment of opium poppies (the plant shown in the image).  The cultivation and use of opium poppies are illegal in most parts of the world, including India, due to their association with the production of illegal narcotics.  Providing advice on their cultivation would be irresponsible and potentially harmful.\n\nMy purpose is to provide helpful and safe information.  Assisting in the cultivation of illegal substances goes against this core principle.\n\nIf you have questions about the cultivation of *legal* crops and are experiencing problems with diseases or pests, please provide an image of a different plant, and I will be happy to offer my expertise within the bounds of the law and ethical guidelines.  I can provide advice on a wide range of plant health issues, including common crop diseases and pest management strategies for legal agricultural practices.\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\download.jpeg",
    "analysis": "**Mango Anthracnose: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe mango has a disease called Anthracnose.  It looks like a dark brown or black, sunken spot on the skin of the mango.  Sometimes it's just a small spot, other times it can be a big, ugly patch.  The affected area might be hard and cracked.  It mostly affects the fruit, but can also show up on leaves and stems.\n\n**2. Why it Happened?**\n\nAnthracnose is caused by a fungus that loves warm, humid weather.  It spreads easily through rain and wind.  If your mango trees are crowded, or the air doesn't circulate well, the fungus has a better chance to grow.  You might see small, black spots (fungal spores) on the fruit's surface.  If you see a lot of rain followed by humid weather, be extra watchful.\n\n**3. How to Fix It?**\n\n* **First:** Carefully remove and destroy all affected mangoes. Don't leave them on the ground or near the tree – bury them deeply or burn them.\n* **Second:** Improve air circulation around your mango trees.  Prune branches to allow more sunlight and air to reach the fruit.\n* **Third:**  If the problem is widespread, consider a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Regularly check your mango trees for any signs of disease.  Remove any affected leaves or fruits immediately.\n* **Warning Signs:** Watch for warm, humid weather, especially after rain.  If you see dark spots on the mangoes, act quickly.  Good air circulation is key.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  Copper oxychloride (available at most agricultural supply stores).  Follow the instructions on the packaging carefully.  A typical 500g pack might cost ₹150-₹250.  Always wear gloves and protective clothing when using chemicals.\n* **Natural Treatment:**  Some farmers have success with a mixture of neem oil and water (1:10 ratio).  Neem oil is relatively inexpensive, around ₹100-₹200 for a 500ml bottle.  Spray the solution on the trees and fruits, ensuring good coverage.\n\n**Important Note:**  Always follow the instructions on the packaging of any chemical treatment.  Overuse can harm the environment and your health.  Natural treatments may require multiple applications.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  Contact your local KVK for advice and information.  They can provide you with the contact details of your local KVK.\n* **Government Help:** Check with your local agricultural department about government subsidies or assistance programs for purchasing agricultural chemicals or inputs.\n* **Local Agriculture Officer:**  Your local agriculture officer can provide expert advice and guidance.\n* **Authorized Shops:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n\n\nRemember, early detection and prompt action are crucial in managing mango anthracnose.  Don't hesitate to seek help from your local agricultural experts if you need further assistance.\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\figure-2-tattered appearance on the affected leaves-404x269.jpg",
    "analysis": "**Advice for Farmers: Dealing with Leaf Spot Disease**\n\n**1. What is the Problem?**\n\nThe problem shown in the image looks like **Leaf Spot disease**.  It's a common problem for many plants.  You'll see small, brown spots on the leaves. These spots might get bigger and join together, causing parts of the leaf to turn brown and die.  The spots are mostly on the leaves, but sometimes they can also appear on the stems.\n\n**2. Why it Happened?**\n\nLeaf spot is usually caused by **fungi** (tiny plants that can cause disease) or **bacteria**.  These tiny organisms love warm, wet weather.  They spread easily through water splashes from rain or watering, or even on your tools if you're not careful.  You might notice the problem more after a period of heavy rain or if your plants are crowded together, not getting enough air circulation. Think of it like a person getting sick – if they're weak (plants not getting enough nutrients or sunlight) and the conditions are right (lots of rain), they're more likely to get sick.\n\n**3. How to Fix It?**\n\nFirst: **Remove affected leaves.** Carefully pick off and destroy (burn or bury deeply) any leaves with spots. This stops the disease from spreading.\n\nSecond: **Improve air circulation.** If your plants are too close, thin them out to let air move freely between them. This helps dry the leaves quickly and makes it harder for fungi to grow.\n\nThird: **Water carefully.** Avoid watering from overhead, which spreads the disease. Try watering at the base of the plants instead.\n\n**4. How to Prevent it Next Time?**\n\n* **Cleanliness is key:** Before and after working with your plants, clean your tools with soap and water or a disinfectant.\n* **Crop rotation:**  Plant different crops in the same area each year. This helps break the cycle of the disease.\n* **Healthy plants:** Make sure your plants are getting enough sunlight, water, and nutrients. Healthy plants are more resistant to disease.\n* **Watch for warning signs:** Keep an eye out for small brown spots on the leaves. Early detection is crucial.\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  A mixture of cow dung and water (1:10 ratio) sprayed on the leaves can sometimes help.  This is a low-cost option.\n* **Chemical Treatment:**  There are many fungicides available.  Ask your local agriculture officer for recommendations.  Some common ones include Mancozeb (approx. ₹100-₹200 per 500g) or Copper Oxychloride (approx. ₹80-₹150 per 500g).  *Always follow the instructions on the label carefully.*\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local agricultural officer.\n* **Government Help:**  Some government schemes may offer subsidies on agricultural inputs, including medicines.  Check with your local agriculture department.\n* **Local Agriculture Officer:**  Your local agriculture officer can provide advice and help you identify the specific disease and recommend the best treatment.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.*\n",
    "label": "leaf spot"
  },
  {
    "image_path": "test_images\\HGIC-veg-squash-rot-5602798.jpg",
    "analysis": "**Advice for Farmers: Dealing with Squash Blossom Blight**\n\n**1. What is the Problem?**\n\nThe problem shown in the image is called **Squash Blossom Blight**.  It's a disease that affects squash and pumpkin plants.  You'll see a dark, grey-black fuzzy mold growing on the flowers, especially the male flowers (the smaller ones).  The mold can also spread to the stems and leaves, making them look brown and withered.  The affected flowers will often fall off before they can produce fruit.\n\n**2. Why it Happened?**\n\nSquash Blossom Blight is caused by a fungus (a tiny plant that causes disease) that loves warm, humid weather.  It spreads easily through the air and water.  If you've had a lot of rain or heavy dew lately, and the weather has been warm, that creates perfect conditions for this fungus to grow.  You might also see this if your plants are too crowded, making it hard for air to circulate.\n\n**3. How to Fix It?**\n\nFirst, **remove any affected flowers and leaves**. Put them in a plastic bag and throw them away, don’t compost them. This will help stop the disease from spreading. Second, **improve air circulation** by thinning out overcrowded plants.  Third, **water your plants at the base**, avoiding wetting the leaves and flowers. This reduces the moisture the fungus needs to grow.\n\n**4. How to Prevent it Next Time?**\n\n* **Plant resistant varieties:**  Ask your local seed supplier for squash varieties that are less likely to get this disease.\n* **Rotate your crops:** Don't plant squash in the same spot every year.  Change the location of your squash patch each season.\n* **Clean up plant debris:** After harvesting, remove all plant material from the field to reduce the amount of fungus that can overwinter.\n* **Avoid overhead watering:** Water at the base of the plant to keep the foliage dry.\n* **Space plants properly:** Ensure adequate spacing between plants for good air circulation.\n* **Watch for warning signs:** Keep a close eye on your plants, especially during warm, humid weather. Look for the fuzzy grey-black mold on the flowers.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment (use only if necessary and follow instructions carefully):**  Mancozeb (local names vary, check with your supplier) is a common fungicide.  A 500g pack might cost around ₹200-₹300.  Always follow the instructions on the packaging carefully.  Mix the fungicide as directed and spray the plants thoroughly, ensuring coverage of all leaves and stems.  Repeat the application every 7-10 days as needed.\n* **Natural Treatment:**  A copper-based fungicide (like Bordeaux mixture) can be used, but it's less effective than Mancozeb.  You can also try a neem oil spray, which has some antifungal properties.  Neem oil is relatively inexpensive, a litre might cost ₹150-₹250.\n\n**Safety Note:**  *This advice is to help you understand your plant's problem. For safety, please:*\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\n**6. Where to Get Help:**\n\n* **Find your local Krishi Vigyan Kendra (KVK):** Search online for \"KVK [your district name]\" to find the nearest center and their contact information.  They can provide expert advice and guidance.\n* **Government help for buying medicines:** Check with your local agricultural department about any subsidies or schemes available for purchasing agricultural inputs, including fungicides.\n* **Local agriculture officers:** Your local agricultural extension office can provide information on local resources and support.\n* **Where to buy safe and genuine medicines:** Purchase agricultural chemicals only from registered dealers or agricultural input stores to ensure quality and safety.\n\n\nRemember, early detection and prompt action are crucial in managing Squash Blossom Blight.  Don't hesitate to seek help from your local agricultural experts if you need further assistance.\n",
    "label": "blight"
  },
  {
    "image_path": "test_images\\images (1).jpeg",
    "analysis": "**Advice for Farmers: Dealing with Pepper Fruit Rot**\n\n**1. What is the Problem?**\n\nThis looks like **Pepper Fruit Rot**.  It's a disease that makes brown, sunken spots appear on your peppers. These spots often start small but get bigger, sometimes covering most of the pepper.  The affected part of the pepper will be mushy and may even have a moldy look.  The rot usually starts on the skin of the pepper but can spread inside.\n\n**2. Why it Happened?**\n\nPepper fruit rot is caused by fungi (tiny plants that cause disease) that love warm, wet conditions.  If your peppers are wet for a long time, especially after rain or heavy watering, these fungi can easily attack.  Cracks or wounds on the pepper also make it easier for the fungi to enter.  Think of it like a cut on your skin – it's easier for germs to get in.  You might see some fuzzy grey or white mold growing on the rotten spots.\n\n**3. How to Fix It?**\n\n* **First:** Carefully remove and destroy all the affected peppers. Don't leave them in the field; bury them deeply or burn them to stop the fungus from spreading.\n* **Second:** Improve air circulation around your pepper plants.  Make sure the plants aren't too crowded, so air can move freely between them.  This helps them dry faster after watering or rain.\n* **Third:** Avoid overhead watering. Water at the base of the plant to keep the peppers dry.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Check your pepper plants regularly for any signs of rot.  Remove any affected peppers immediately.\n* **Warning Signs:** Look for small brown spots, mushy areas, or any unusual discoloration on your peppers.  Pay close attention after periods of rain or heavy watering.  Good air circulation and avoiding overhead watering are key.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  You can use fungicides like Mancozeb (local names vary, check with your local supplier).  A typical cost might be ₹100-₹200 per 500g pack.  *Always follow the instructions on the label carefully.*\n* **Natural Treatment:**  Some farmers have success with spraying a mixture of baking soda and water (1 tablespoon baking soda per gallon of water). This is a low-cost option, but it might not be as effective as a chemical fungicide.\n\n**Important Note:**  Fungicides can be harmful if not used correctly.  Always wear protective gloves and clothing when applying them.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local agricultural officer. They can provide expert advice and information.\n* **Government Help:**  Check with your local agricultural department for information on government subsidies or assistance programs for purchasing agricultural inputs, including fungicides.\n* **Local Agriculture Officer:**  Your local agriculture officer can identify the problem accurately and recommend the best course of action.\n* **Authorized Shops:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (10).jpeg",
    "analysis": "**Advice for Farmers:  Cabbage Leaf Spot**\n\n**1. What is the Problem?**\n\nThe problem is **Cabbage Leaf Spot**.  It's a disease that makes brown or tan spots appear on the leaves of your cabbage plants.  These spots can be different sizes, and sometimes they grow together.  The spots mostly affect the leaves, making them look unhealthy and possibly reducing the size of your cabbage heads.\n\n**2. Why it Happened?**\n\nCabbage leaf spot is usually caused by a fungus (a tiny plant that can't be seen without a microscope) that likes wet and humid weather.  It spreads easily when the leaves are wet from rain or watering.  You might notice the spots more after a period of heavy rain or if your field is poorly drained and stays wet for a long time.  If you see lots of spots on the lower leaves first, that's a good sign of this disease.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy (burn or bury deeply) any severely affected leaves. This stops the fungus from spreading further.\n* **Second:** Improve air circulation around your plants.  This means making sure your plants aren't too crowded. Thin them out if necessary.  Good airflow helps the leaves dry quickly after rain or watering.\n* **Third:**  If the problem is widespread, you may need to use a fungicide.\n\n**4. How to Prevent it Next Time?**\n\n* **Plant healthy seedlings:** Start with disease-free plants.\n* **Rotate your crops:** Don't plant cabbage in the same place every year.  Change the location of your cabbage patch each season.\n* **Water carefully:** Avoid overhead watering (watering from above), which keeps the leaves wet for too long. Water at the base of the plants instead.\n* **Good drainage:** Make sure your field drains well to avoid waterlogging.\n* **Watch for early signs:** Regularly check your plants for any spots or discoloration.  Early detection is key.\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  A solution of cow dung and water (1:10 ratio) sprayed on the plants can sometimes help.  This is a low-cost option.\n* **Chemical Treatment (Use only if necessary and follow instructions carefully):**  There are many fungicides available.  Ask your local agriculture officer for recommendations and the correct dosage.  Some common fungicides include Mancozeb (available in various brands and formulations, cost varies from ₹100-₹500 per kg, depending on the brand and packaging).  **Always follow the instructions on the label carefully.**\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local village officer. They can provide expert advice and identify the disease accurately.\n* **Government Help:**  Inquire at your local agriculture office about government subsidies or schemes for purchasing agricultural inputs, including fungicides.\n* **Local Agriculture Officer:** Your local agriculture officer can help you identify the disease and recommend appropriate treatments.\n* **Buy Medicines:** Purchase medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n\n\n**Disclaimer:** This advice is for general information only and does not constitute professional agricultural advice.  Always consult with a local agricultural expert for accurate diagnosis and treatment recommendations specific to your situation.  The costs mentioned are approximate and may vary depending on location and retailer.\n",
    "label": "leaf spot"
  },
  {
    "image_path": "test_images\\images (11).jpeg",
    "analysis": "**Mango Anthracnose: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe mangoes have **Mango Anthracnose**, a common disease.  It looks like dark, sunken spots or scabs on the skin of the mangoes.  These spots can be small or large and often grow together, covering a big part of the fruit.  The spots are usually black or dark brown.  The disease affects the fruit itself, making it rot and unusable.\n\n**2. Why it Happened?**\n\nAnthracnose happens because of a fungus that loves warm, humid weather.  It spreads easily through rain, wind, and insects.  If your mangoes were growing in a shady, poorly ventilated area with high humidity, the fungus had the perfect conditions to grow.  You might also see signs like small, black spots on the leaves and twigs.  Think of it like a cold – if the conditions are right, it spreads easily.\n\n**3. How to Fix It?**\n\n* **First:** Carefully remove and destroy all affected mangoes.  Don't leave them near the trees, as the fungus can spread from them. Bury them deeply or burn them.\n* **Second:** Clean the area around the mango trees. Remove any fallen leaves or fruit.  Good air circulation is key.\n* **Third:**  If the disease is widespread, consider a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Regularly inspect your mango trees for any signs of disease.  Remove any diseased fruit or leaves immediately. Keep the area around the trees clean and free of debris.\n* **Warning Signs:** Watch for dark spots on leaves, twigs, and especially the fruit.  High humidity and rainfall are prime conditions for the disease to spread.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment (Consult your local agriculture officer before using):**  Copper oxychloride (available at most agricultural supply stores).  The cost varies but expect to pay around ₹100-₹300 per kg.  Follow the instructions on the packaging carefully.  Always wear protective gear like gloves and a mask.\n* **Natural Treatment:**  A mixture of cow dung and water (1:10 ratio) can be sprayed on the trees. This is a less effective but safer option.  It's inexpensive, costing only the labor involved.\n\n**Safety Note:**  Copper oxychloride is a chemical, so use it carefully.  Always follow instructions.  Natural treatments are safer but might not be as effective.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agricultural department.]\n* **Government Help:**  Many government schemes offer subsidies on agricultural inputs, including pesticides.  Inquire at your local agricultural office.\n* **Local Agriculture Officer:** [Find their contact information through your local government website or panchayat.]\n* **Authorized Shops:** Buy medicines only from registered agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\images (12).jpeg",
    "analysis": "**Advice for Farmers: Dealing with Citrus Greasy Spot**\n\n**1. What is the Problem?**\n\nThe problem is **Citrus Greasy Spot**.  It makes the lemons look like they have lots of tiny, dark brown or reddish-brown spots all over the skin.  These spots are mostly on the fruit, but sometimes you'll see them on the leaves too.  The spots look oily or greasy, hence the name.\n\n**2. Why it Happened?**\n\nCitrus Greasy Spot is caused by a fungus that likes warm, humid weather.  It thrives in areas with poor air circulation, like when trees are too crowded.  You'll see it more often after periods of rain or high humidity.  If you notice lots of spots on the fruit, especially during humid weather, it's likely this fungus.\n\n**3. How to Fix It?**\n\nFirst: **Improve air circulation.**  Thin out your lemon trees if they are too crowded.  This lets air flow better and dries the leaves and fruit faster, making it harder for the fungus to grow.\n\nSecond: **Clean up fallen leaves and fruit.**  The fungus can live in fallen plant material.  Remove and destroy these to reduce the amount of fungus around your trees.\n\nThird: **Water at the base of the tree.** Avoid wetting the leaves and fruit as much as possible when watering. Wet leaves and fruit create ideal conditions for the fungus to grow.\n\n**4. How to Prevent it Next Time?**\n\n* **Regular pruning:** Keep your trees well-pruned to improve air circulation. Do this once or twice a year, depending on the growth of your trees.\n* **Proper spacing:** Make sure your trees have enough space between them.\n* **Sanitation:** Regularly remove fallen leaves and fruit.\n* **Watch for warning signs:** Keep an eye out for small, dark spots on the fruit and leaves, especially after rainy periods or humid weather.  Early detection is key.\n\n**5. Treatment Options:**\n\n* **Copper-based fungicides:** These are common and relatively inexpensive.  You can find them at agricultural supply stores.  Look for products containing copper oxychloride.  The cost varies, but you can expect to pay around ₹100-₹300 per litre, depending on the brand and concentration.  Always follow the instructions on the label carefully.  **Safety Note:** Copper-based fungicides can be harmful if not used correctly.\n\n* **Natural options:** Some farmers use neem oil (₹150-₹300 per litre) as a natural fungicide.  Mix it with water according to the instructions on the label and spray it on the affected parts of the tree.  This might not be as effective as chemical treatments, but it's a safer option.\n\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):**  Contact information for your nearest KVK can usually be found online or through your local agricultural department.\n* **Government subsidies:**  Check with your local agricultural department about any government schemes that might offer subsidies on agricultural inputs, including fungicides.\n* **Local agriculture officer:** Your local agricultural officer can provide specific advice and guidance based on your location and the severity of the problem.\n* **Authorized shops:** Buy your medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "greasy spot"
  },
  {
    "image_path": "test_images\\images (13).jpeg",
    "analysis": "**Advice for Farmers: Dealing with Citrus Greening Disease (Huanglongbing)**\n\n**1. What is the Problem?**\n\nThe problem shown in the picture looks like **Citrus Greening Disease**, also sometimes called Huanglongbing (HLB).  It's a serious disease that affects citrus fruits like lemons, limes, and oranges.  \n\nThe disease makes the fruits small and misshapen.  You'll see blotchy, yellowing leaves, and the fruits themselves will be lopsided and have a bitter taste.  The skin of the fruit might be bumpy or have spots.  Both the leaves and fruits are affected.\n\n**2. Why it Happened?**\n\nCitrus Greening is caused by a tiny bacteria spread by a small insect called a psyllid (a type of jumping plant louse).  This insect sucks sap from the leaves and spreads the bacteria as it moves from tree to tree.  The bacteria infect the tree's vascular system (like its veins), blocking the flow of nutrients and water.\n\nSigns you might see:  Yellowing leaves with a mottled pattern (like a mix of green and yellow), small and misshapen fruits, and generally unhealthy-looking trees.  You might also see the psyllids themselves – tiny insects on the leaves and young shoots.\n\n**3. How to Fix It?**\n\nUnfortunately, there's no cure for Citrus Greening once a tree is infected.  However, you can try to manage the disease and prevent it from spreading further:\n\n* **First:** Remove and destroy any severely infected branches or whole trees.  Burn them if possible to prevent the spread of the bacteria.\n* **Second:**  Improve tree health by providing proper watering and fertilization.  A healthy tree can better fight off the disease.\n* **Third:**  Monitor your trees regularly for signs of the disease and psyllids.\n\n**4. How to Prevent it Next Time?**\n\n* **Regular Inspection:** Check your trees weekly for signs of yellowing leaves, misshapen fruits, and psyllids.\n* **Psyllid Control:** Use appropriate insecticides to control the psyllid population.  Your local agriculture officer can advise on the best options and safe application methods.\n* **Healthy Trees:** Ensure your trees are healthy and strong through proper watering, fertilization, and pruning.  This makes them more resistant.\n* **Nursery Stock:** Buy healthy, certified disease-free seedlings from reputable nurseries.\n\n**5. Treatment Options:**\n\nThere is no cure for HLB, but management practices are crucial.  \n\n* **Insecticides:**  Several insecticides are available to control psyllids.  Your local agriculture officer can recommend specific products and their correct usage.  Prices vary greatly depending on the product and quantity (₹500-₹2000 per litre, approximately).  Always follow instructions carefully.\n* **Natural Methods:**  Maintaining tree health through proper fertilization and watering is crucial.  Some farmers also use neem oil as a natural insecticide, but its effectiveness against psyllids may be limited.  Neem oil can cost around ₹200-₹500 per litre.\n\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local agricultural officer.\n* **Government Help:**  Inquire at your local agricultural office about government subsidies or assistance programs for purchasing medicines or managing citrus diseases.\n* **Local Agriculture Officer:** Contact your local agriculture officer for advice and guidance.  They can help you identify the disease, recommend appropriate treatments, and provide information on government schemes.\n* **Authorized Shops:** Always buy medicines and insecticides from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.*\n\n\n**Disclaimer:** This information is for general guidance only.  Always consult with your local agricultural experts for specific advice tailored to your region and situation.  Prices mentioned are approximate and may vary.\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\images (14).jpeg",
    "analysis": "**Advice for Farmers: Dealing with Cherry Fruit Rot**\n\n**1. What is the Problem?**\n\nThe problem shown in the picture is **Cherry Fruit Rot**.  It's a disease that makes cherries go bad while they're still on the tree.  You'll see dark brown or black spots on the cherries, which can grow bigger and rot the whole fruit.  The affected cherries often shrivel up.  Only the fruit is affected, not the leaves or branches.\n\n**2. Why it Happened?**\n\nCherry fruit rot is caused by fungi (tiny plants you can't see) that love warm, wet weather.  These fungi spread easily when there's rain or high humidity (lots of moisture in the air).  You might see signs like small, dark spots appearing on the cherries after a period of rain or heavy dew.  Sometimes, insects can spread the fungus from one fruit to another.  Think of it like a cold spreading between people – the fungus needs a way to travel.\n\n**3. How to Fix It?**\n\n* **First:** Carefully remove and destroy all the rotten cherries.  Don't leave them on the tree or on the ground, as this will spread the fungus.  Burn them or bury them deep.\n* **Second:** Improve air circulation around your cherry trees.  This means pruning away some branches to let air and sunlight reach the fruit.  This helps the fruit dry faster after rain, making it harder for the fungus to grow.\n* **Third:**  If the rot is widespread, consider a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Check your cherry trees regularly, especially after rain or periods of high humidity.  Remove any rotten fruit immediately.\n* **Warning Signs:** Watch for dark spots on the cherries, especially during wet weather.  If you see even a few spots, act quickly.\n\n**5. Treatment Options:**\n\nIf the problem is serious, you can use these treatments:\n\n* **Chemical Treatment:**  Some fungicides (chemicals that kill fungi) are effective against cherry fruit rot.  Ask your local agriculture officer about suitable options available in your area.  They can advise on the correct dosage and application method.  Always follow the instructions carefully.  *Example:*  (Insert local fungicide name and approximate cost in ₹ here –  this requires local knowledge).  **Safety Note:**  Always wear protective gloves and clothing when using fungicides.\n\n* **Natural Treatment:**  Some farmers use a mixture of baking soda and water as a natural fungicide.  Mix 1 tablespoon of baking soda in 1 litre of water and spray it on the trees.  This is less effective than chemical treatments, but it's a safer option.\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):** (Insert your local KVK's address and phone number here).\n* **Government Help:**  (Insert information about any government subsidies or programs for purchasing agricultural medicines in your area).\n* **Local Agriculture Officer:** (Insert name and contact information of your local agriculture officer).\n* **Where to Buy Medicines:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n\n\n**Disclaimer:**  This advice is for general information only.  Specific treatment recommendations depend on your location, the severity of the problem, and other factors.  Always consult with your local agriculture officer for personalized guidance.\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (15).jpeg",
    "analysis": "**Advice for Farmers: Cherry Fruit Damage**\n\n**1. What is the Problem?**\n\nThe problem shown in the image looks like damage caused by **Cherry Fruit Flies** (or something similar).  It's not exactly a disease, but a pest problem.  The cherries show small holes and are rotting.  The damage is mainly on the fruit itself.\n\n\n**2. Why it Happened?**\n\nCherry fruit flies lay their eggs inside the cherries.  The eggs hatch into larvae (small worms) that eat the inside of the fruit, causing it to rot and become damaged.  This often happens when the fruit is ripening.  You might see small, dark spots on the fruit's surface before the holes appear.  Think of it like tiny insects boring into your cherries.\n\n\n**3. How to Fix It?**\n\n* **First:** Check all your cherry trees carefully. Look for damaged fruit and remove and destroy any affected cherries immediately.  Don't leave them on the ground or near the trees, as this will help the flies spread.  Dispose of them far from the orchard.\n\n* **Second:**  Try a simple, low-cost method first:  Place sticky traps around your trees.  These traps attract the flies and catch them.  You can buy these or make your own using yellow sticky paper.\n\n* **Third:** If the problem is severe, you might need to use a pesticide.\n\n\n**4. How to Prevent it Next Time?**\n\n* **Regular checks:**  Inspect your trees regularly, especially when cherries are starting to ripen.  Early detection is key.\n\n* **Cleanliness:**  Remove fallen fruit promptly.  Don't let rotting fruit stay near the trees.\n\n* **Netting:** Consider covering your trees with fine netting to prevent the flies from reaching the cherries. This is especially useful during the ripening season.\n\n\n**5. Treatment Options:**\n\n* **Natural Options:**  Sticky traps (₹50-₹150 per pack, depending on size and type).  These are readily available at most agricultural supply stores.\n\n* **Chemical Options:**  Consult your local agriculture officer for recommended pesticides for cherry fruit flies.  They can advise on safe and effective options, including those registered for use in your area.  **Do not use pesticides without expert advice.**  Pesticides can be expensive (₹200-₹1000 or more depending on the type and quantity).  Always follow instructions carefully.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local village leader. They can provide expert advice and guidance.\n\n* **Government Help:**  Inquire at your local agriculture department about subsidies or assistance programs for purchasing pesticides or other control measures.\n\n* **Local Agriculture Officer:**  Your local agriculture officer can identify the pest accurately and recommend appropriate treatments.  They can also tell you where to buy safe and genuine medicines.\n\n* **Authorized Shops:**  Buy pesticides and other treatments only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.*\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (16).jpeg",
    "analysis": "**Citrus Greasy Spot: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe problem is **Citrus Greasy Spot**.  It looks like your citrus leaves have lots of small, oily-looking spots. These spots are usually dark brown or reddish-brown in the center, surrounded by a yellowish area.  The spots are mostly on the leaves, but sometimes you might see them on the fruit too.  The leaves might look a bit greasy or shiny.\n\n**2. Why it Happened?**\n\nCitrus Greasy Spot is caused by a fungus (a tiny plant that causes disease).  It likes warm, humid weather and thrives when there's not enough air circulation around the plants.  Think of it like a person getting sick in a crowded, stuffy room – the fungus spreads easily in crowded, damp conditions.  You might see the problem more after a rainy season or if your trees are too close together.\n\n**3. How to Fix It?**\n\n* **First:**  Improve air circulation.  Prune (cut back) branches to let more air and sunlight reach the leaves.  Don't let the trees get too crowded.\n* **Second:**  Clean up fallen leaves.  The fungus lives in fallen leaves, so remove and destroy them to reduce the spread.\n* **Third:**  Water your trees properly.  Avoid overhead watering (watering from above), which keeps the leaves wet for too long. Water at the base of the tree instead.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your trees regularly for spots.  Early detection is key!\n* **Prevention:** Plant your trees far enough apart to allow good air circulation.  Prune regularly to keep the canopy open.  Avoid overhead watering.  Use good quality planting material.\n\n**5. Treatment Options:**\n\n* **Copper-based fungicides:** These are common and relatively inexpensive. You can find them at authorized agricultural shops.  Look for products containing copper oxychloride.  The cost varies, but expect to pay around ₹100-₹300 per litre, depending on the brand and concentration.  Always follow the instructions on the label carefully.\n* **Natural Options:** Some farmers use neem oil (₹50-₹150 per litre) as a preventative measure.  It's not as effective as copper fungicides for established infections, but it can help prevent new infections.  Mix it according to the instructions on the label.\n\n**Instructions for using treatments:**  Always wear gloves and protective clothing when applying any fungicide.  Follow the instructions on the label carefully regarding dilution and application methods.\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):**  [Find your nearest KVK online or by asking your local agricultural officer].\n* **Government Help:**  Inquire at your local agricultural office about subsidies or assistance programs for purchasing agricultural inputs.\n* **Local Agriculture Officer:** [Name and contact details of your local agriculture officer – obtain this information from your local government office].\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\n**Disclaimer:** This information is for general guidance only and does not constitute professional agricultural advice.  Always consult with a qualified agricultural expert for specific recommendations tailored to your situation.  Prices mentioned are approximate and may vary depending on location and vendor.\n",
    "label": "greasy spot"
  },
  {
    "image_path": "test_images\\images (2).jpeg",
    "analysis": "The image shows a plant with a root disease, likely **Root Knot Nematode**.\n\n**1. What is the Problem?**\n\nThis is a problem with the roots of your plant.  We call it \"Root Knot Disease\".  You'll see lots of little, bumpy swellings or knots on the roots.  They look like small, pale lumps, almost like tiny potatoes growing on the roots. These knots stop the roots from working properly.\n\n**2. Why it Happened?**\n\nTiny worms called nematodes are causing this. They live in the soil and attack the roots.  They make the roots swell and become unhealthy.  You might see your plants looking weak, yellowing, and not growing well, even if you water and fertilize them.  The soil might also be a bit dry around the plant.\n\n**3. How to Fix It?**\n\nFirst: **Remove infected plants.** Carefully dig up the affected plants and remove them from the field.  Burn them or bury them deeply to prevent the spread of the disease.\n\nSecond: **Improve soil drainage.** Nematodes like wet, poorly drained soil.  Make sure your field drains well.  You can do this by creating small ditches or improving the soil structure by adding organic matter (like compost or well-rotted manure).\n\nThird: **Solarization:**  If possible, cover the affected area with clear plastic sheeting during the hottest part of the year. The heat from the sun will kill many of the nematodes in the soil.\n\n**4. How to Prevent it Next Time?**\n\n* **Crop Rotation:**  Don't plant the same crop in the same place year after year.  Rotate your crops to break the nematode life cycle.\n* **Healthy Soil:**  Maintain healthy soil by adding organic matter regularly. This improves the soil structure and makes it less hospitable to nematodes.\n* **Resistant Varieties:**  If possible, use plant varieties that are resistant to root-knot nematodes. Ask your local agriculture officer for recommendations.\n* **Regular Inspection:**  Check your plants regularly for signs of root knots. Early detection is key!\n\n**5. Treatment Options:**\n\n* **Chemical Nematicides:**  These are strong chemicals that kill nematodes.  However, they can be expensive and harmful to the environment if not used correctly.  Examples include Carbofuran (but availability and use may be restricted, check with local authorities).  **Cost:** Varies greatly, but expect to pay ₹500-₹1500 per litre (depending on the product and quantity).  **Always follow the instructions carefully and wear protective gear.**\n\n* **Natural Methods:**  Marigold plants are known to repel some nematodes. Planting marigolds around your crops can help.  Neem cake is also a natural option, but its effectiveness against nematodes can vary.  **Cost:** Neem cake can cost around ₹20-₹50 per kg.\n\n**Instructions for Chemical Nematicides:**  Always follow the instructions on the label carefully.  Wear gloves, a mask, and protective clothing.  Avoid contact with skin and eyes.  Dispose of empty containers properly.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  Contact your local KVK for advice and information.  (Find your local KVK online or through your local agricultural department).\n* **Government Help:**  Inquire about government subsidies or programs that may help you buy necessary medicines or treatments.\n* **Local Agriculture Officer:**  Contact your local agriculture officer for guidance and support.\n* **Authorized Shops:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\nRemember, prevention is always better than cure.  By following these simple steps, you can significantly reduce the impact of root-knot nematodes on your crops.\n",
    "label": "nematode"
  },
  {
    "image_path": "test_images\\images (3).jpeg",
    "analysis": "**Advice for Farmers: Dealing with Anthracnose on Strawberries**\n\n**1. What is the Problem?**\n\nThe problem shown in the pictures is **Anthracnose**, a common strawberry disease.  It's like a nasty spot that appears on the leaves and fruits.\n\nOn the *leaves*, you'll see brown or reddish-brown spots, often starting at the edges and spreading inwards.  These spots can get bigger and make the leaves look scorched or dried out.\n\nOn the *fruits*, you'll see sunken, dark brown or black spots that are firm to the touch. These spots can grow larger, making the strawberries rot and inedible.\n\n\n**2. Why it Happened?**\n\nAnthracnose happens because of a fungus that loves warm, humid weather.  It spreads easily through water splashes (rain or irrigation) and infected plants.  Think of it like a cold spreading through a crowded classroom – if one plant is sick, it can easily spread to others.  You might also see it if you use tools or containers that haven't been cleaned properly between plants.\n\n**Signs to Watch For:**\n\n* Small, dark spots on leaves and fruits.\n* Spots growing bigger and causing leaf damage or fruit rot.\n* Warm, humid weather conditions.\n\n\n**3. How to Fix It?**\n\nFirst: **Remove and destroy** any severely affected leaves and fruits.  Burn them or bury them deep to stop the fungus from spreading.\n\nSecond: **Improve air circulation** around your plants.  This means making sure your plants aren't too crowded.  You can prune some leaves to let air flow better.\n\nThird: **Use a fungicide** (explained below).\n\n\n**4. How to Prevent it Next Time?**\n\n* **Plant resistant varieties:** Ask your local agriculture officer about strawberry varieties that are less likely to get Anthracnose.\n* **Proper spacing:** Don't plant your strawberries too close together.  This helps air circulate and prevents the fungus from spreading easily.\n* **Water carefully:** Avoid overhead watering, which can spread the fungus.  Water at the base of the plants instead.\n* **Clean tools:** Always clean and disinfect your tools (knives, shears) with rubbing alcohol or bleach solution between uses.\n* **Crop rotation:** Avoid planting strawberries in the same spot year after year.\n\n\n**5. Treatment Options:**\n\n* **Chemical Fungicides:**  Consult your local agriculture officer for recommendations on suitable fungicides and their application rates.  Prices vary greatly depending on the brand and quantity.  Always follow the instructions on the label carefully.  *Example:* Mancozeb (prices vary greatly, ₹50-₹200 per 100g, depending on the brand and retailer).\n\n* **Natural Treatments:**  Some farmers have success with using a diluted solution of cow urine (1:10 ratio with water) as a natural fungicide.  This is a low-cost option, but its effectiveness can vary.\n\n\n**Instructions for Safe Use:**\n\n* Always wear gloves and protective clothing when handling fungicides.\n* Follow the instructions on the label carefully.\n* Store fungicides safely, away from children and pets.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agriculture department.]\n* **Government Help:**  Inquire at your local agriculture office about government subsidies or programs for purchasing agricultural inputs.\n* **Local Agriculture Officer:** [Find their contact information through your local government website or your village head.]\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:**\n\nThis advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\images (4).jpeg",
    "analysis": "The image shows a fungal growth, likely a type of soilborne disease affecting the roots of plants.  Let's call it **Root Rot**.\n\n**1. What is the Problem?**\n\nRoot rot is a disease that makes the roots of your plants sick.  You'll see a white or greyish fuzzy growth on the roots and sometimes even on the soil surface, like in the picture.  The roots will look mushy and brown, instead of healthy and white.  This stops the plant from getting water and nutrients, making the whole plant weak and unable to grow properly.  The leaves might wilt and yellow, and the plant might even die.\n\n**2. Why it Happened?**\n\nRoot rot happens because of fungi living in the soil. These fungi love wet, soggy soil.  If your soil is too wet for too long, or if there's not enough drainage, the fungi will thrive and attack the roots.  Planting too densely, so plants are crowded, also makes it worse as it keeps the soil wet.  You might notice the soil stays wet for days even after watering.\n\n**3. How to Fix It?**\n\nFirst: **Improve drainage**.  If the soil is waterlogged, try digging small ditches to help water drain away.  Loosen the soil around the plants to improve air circulation.\n\nSecond: **Reduce watering**. Water only when the soil is dry to the touch.  Don't overwater.\n\nThird: **Remove affected plants**. If a plant is severely affected, it's best to remove it completely and destroy it (burn it or bury it deeply) to prevent the disease from spreading.\n\n**4. How to Prevent it Next Time?**\n\n* **Well-drained soil:** Before planting, make sure your soil drains well. Add organic matter like compost to improve drainage.\n* **Proper spacing:** Don't plant your crops too close together. Give them enough space to breathe and avoid waterlogging.\n* **Avoid overwatering:** Water deeply but less frequently. Check the soil moisture before watering.\n* **Crop rotation:** Change the type of crop you plant each year to prevent the build-up of soilborne diseases.\n* **Watch for early signs:** Look for wilting leaves, yellowing, and stunted growth.\n\n**5. Treatment Options:**\n\n* **Chemical treatment (Use with caution and only after consulting your local agriculture officer):**  There are fungicides available, but their cost and specific names vary greatly.  You can ask your local agriculture officer or shop for recommendations.  Prices start from ₹100-₹500 per bottle, depending on the size and type.  **Always follow instructions carefully.**\n\n* **Natural treatment:**  Some farmers use a solution of cow dung and water (1:10 ratio) to improve soil health and suppress the fungi.  This is a low-cost option but may not be as effective as chemical treatments in severe cases.\n\n**6. Where to Get Help:**\n\n* **Find your nearest Krishi Vigyan Kendra (KVK):**  [Insert local KVK contact information here – you'll need to replace this with the actual local information]. They can provide advice and identify the specific disease.\n* **Government help:**  Inquire about government subsidies or schemes for purchasing agricultural inputs, including fungicides, at your local agriculture office.\n* **Local agriculture officer:** [Insert name and contact information of local agriculture officer here – you'll need to replace this with the actual local information].\n* **Buy medicines from authorized shops:**  Only buy medicines from reputable agricultural supply stores to ensure they are genuine and safe.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\n**Remember:** This advice is general.  The specific treatment will depend on the exact type of root rot and your local conditions.  Always consult with your local agriculture officer for personalized advice.\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (5).jpeg",
    "analysis": "The image shows a plant's roots with signs of a soilborne disease, likely a type of root rot.  Let's break down how to deal with this:\n\n\n**1. What is the Problem?**\n\n* **Simple Name:** Root Rot\n* **What it Looks Like:**  The roots look unhealthy, maybe mushy or discolored (brown or dark). You might see white or greyish fluffy patches (like cotton) on the roots, as shown in the picture.  The plant above ground might be wilting, even if the soil is wet.\n* **Affected Parts:** The roots are mainly affected, but this will eventually make the whole plant sick.\n\n\n**2. Why it Happened?**\n\n* **Causes:** Root rot happens when the soil is too wet for too long.  This makes it hard for the roots to breathe, and fungi or bacteria can easily attack them.  Poor drainage in the field, overwatering, or heavy rain can all cause this.\n* **Signs:**  Wilting plants, even with enough water;  roots that are dark, soft, and mushy;  the white/grey fluffy stuff on the roots (fungi).\n\n\n**3. How to Fix It?**\n\n1. **First:** Improve drainage.  Make sure water can drain away from the plant roots easily.  This might mean digging small ditches around the plants or improving the soil structure.\n2. **Second:** Reduce watering.  Only water when the soil is dry to the touch.  Avoid overwatering.\n3. **Third:** If the problem is severe, carefully remove the affected plants and soil around them.  This stops the disease from spreading.\n\n\n**4. How to Prevent it Next Time?**\n\n* **Tips:** Plant in well-drained soil.  Avoid overwatering.  Rotate your crops every year.  Don't plant too close together (give plants enough space).  Make sure your field has good drainage.  Check your plants regularly for wilting or discoloration.\n* **Warning Signs:** Wilting plants, even with watering;  discolored or mushy roots.\n\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  Try using Trichoderma (a beneficial fungus) which can be purchased from agricultural supply stores.  It helps fight off harmful fungi.  (Cost: ₹50-₹150 per packet, depending on size and brand).  Follow the instructions on the packet carefully.\n* **Chemical Treatment:**  In severe cases, you might need a fungicide.  Consult your local agriculture officer for recommendations and safe usage.  (Cost varies greatly depending on the fungicide and quantity, from ₹200 upwards).  **Always follow the instructions on the label carefully.**\n\n\n**6. Where to Get Help:**\n\n* **Local KVK (Krishi Vigyan Kendra):**  [Find your nearest KVK location and contact information online or through your local agricultural department.]\n* **Government Help:**  Some government schemes may offer subsidies on agricultural inputs, including fungicides.  Check with your local agricultural officer for details.\n* **Local Agriculture Officer:**  [Get their name and contact details from your local agricultural department.]\n* **Where to buy medicines:** Buy medicines only from authorized agricultural input dealers or shops.  Avoid buying from unauthorized sellers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\nRemember, early detection and prevention are key to managing root rot.  Don't hesitate to seek help from your local agricultural experts if you're unsure about anything.\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (6).jpeg",
    "analysis": "**Apple Scab: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe problem is **Apple Scab**.  It's a disease that makes dark, scabby spots appear on the apples.  These spots can be small and raised, or larger and cracked.  They can be on the skin of the apple, and sometimes even affect the leaves.\n\n**2. Why it Happened?**\n\nApple scab is caused by a fungus that likes wet and cool weather.  It spreads easily through splashing water (rain or irrigation) and wind.  You'll see signs like small, olive-green spots on leaves and fruit early on.  These spots will darken and become scabby as the disease progresses.  Think of it like a fungal infection that spreads quickly in damp conditions, just like a cold spreads easily when it's wet and cold.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy (burn if possible) all affected apples and leaves.  This stops the fungus from spreading further.\n* **Second:**  Improve air circulation around your apple trees.  Prune branches to let sunlight and air reach all parts of the tree. This helps the leaves dry quickly after rain or watering.\n* **Third:**  If the infection is widespread, consider using a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your trees regularly for any spots or unusual growth.  Early detection is key!\n* **Warning Signs:** Look for small, olive-green spots on leaves and fruit.  These are the first signs of scab.\n* **Preventive Measures:**  Plant disease-resistant apple varieties if possible.  Ensure good drainage around your trees to avoid waterlogging.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  Copper oxychloride (available at most agricultural shops).  Cost: ₹ [Insert approximate cost per kg/litre – this will vary by location].  **Always follow instructions on the label carefully.**  Mix as directed and spray the trees thoroughly, covering all parts. Repeat applications as needed, following the product's instructions.\n* **Natural Treatment:**  Some farmers use neem oil as a natural fungicide.  Cost: ₹ [Insert approximate cost per litre – this will vary by location].  Dilute it according to the instructions on the bottle and spray on the affected parts.  It might not be as effective as chemical treatments for severe infections.\n\n**Safety Note:**  Copper oxychloride and neem oil can irritate skin and eyes. Wear gloves, protective clothing, and eye protection when using them.\n\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):**  [Insert the address and contact number of the nearest KVK].  They can provide expert advice and identify the problem accurately.\n* **Government Help:**  [Insert information about any government subsidies or schemes available for purchasing agricultural medicines in your area].  Inquire at your local agricultural office.\n* **Local Agriculture Officer:** [Insert name and contact information of the local agriculture officer].\n* **Where to Buy Medicines:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n\n\n**Remember to replace the bracketed information with details specific to the farmer's location.**\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\images (7).jpeg",
    "analysis": "**Papaya Fruit Rot: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe papaya fruit shows signs of **fruit rot**.  It looks like a large, pale, whitish or grayish patch on the papaya, sometimes with sunken areas.  The affected part of the fruit is usually soft and may have a slightly moldy smell. The problem is mostly on the fruit itself, but sometimes the stem near the fruit can also be affected.\n\n**2. Why it Happened?**\n\nThis rot is usually caused by **fungi** (tiny plants that can cause disease) or **bacteria** (tiny living things that can also cause disease).  These tiny organisms enter the fruit through small cuts or bruises, often caused by insects, strong winds, or careless handling during harvesting.  Hot, humid weather makes the problem worse because these organisms love warm, damp conditions.  Think of it like a cut on your hand – if it's dirty and wet, it's more likely to get infected.\n\n**3. How to Fix It?**\n\n* **First:** Carefully remove and destroy all affected fruits.  Don't leave them on the tree or on the ground, as this spreads the disease.  Burn them or bury them deeply.\n* **Second:**  Clean the area around the affected fruit on the tree with a clean cloth. You can use a mild solution of soap and water.\n* **Third:**  If you have many affected fruits, you might need to use a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Regularly inspect your papaya trees for any signs of damage to the fruits.  Look for cuts, bruises, or insect damage.\n* **Warning Signs:** Watch out for unusually hot and humid weather.  This is when the rot spreads fastest.  Also, keep an eye out for insects that might damage the fruit.\n\n**5. Treatment Options:**\n\nIf the problem is widespread, you can try these treatments:\n\n* **Natural Treatment:**  A solution of cow dung and water (1:10 ratio) can sometimes help.  Spray this on the fruits and the surrounding area.  This is cheap (almost free!).\n* **Chemical Treatment:**  Your local agriculture officer can recommend suitable fungicides (medicines that kill fungi) or bactericides (medicines that kill bacteria).  Examples include Copper Oxychloride (prices vary, around ₹100-₹300 per kg depending on the brand and quantity) or Mancozeb (similar price range).  **Always follow the instructions on the label carefully.**\n\n**Important Note:**  The amount of medicine you need will depend on the size of your farm and the severity of the problem.  Ask your local agriculture officer for advice on the correct dosage.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or ask your village leader].\n* **Government Help:**  Many government schemes offer subsidies (partial payment) on agricultural inputs, including medicines.  Inquire at your local agriculture office.\n* **Local Agriculture Officer:** [Name and contact information of your local agriculture officer].\n* **Where to buy medicines:** Buy medicines only from authorized agricultural input dealers to ensure they are genuine and safe.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\images (8).jpeg",
    "analysis": "I cannot provide advice on the cultivation or treatment of the plant shown in the image.  The image depicts *Cannabis sativa*, a plant whose cultivation and use are heavily regulated, and often illegal, in many parts of the world, including India.  Providing advice on its cultivation would be irresponsible and potentially illegal.\n\nMy purpose is to offer helpful and safe information.  Giving instructions on growing this plant would violate that purpose.\n\nIf you have questions about the health of other crops, please provide an image of a different plant, and I will be happy to offer my expertise within the bounds of the law and ethical guidelines.\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\images (9).jpeg",
    "analysis": "**Apple Scab: A Simple Guide for Farmers**\n\n**1. What is the Problem?**\n\nThe problem is **Apple Scab**.  It's a disease that makes dark, scabby spots appear on the apples.  These spots can be brown or black and look like rough patches on the skin.  Sometimes, they can also affect the leaves.  The spots can make the apples look ugly and reduce their quality, making them less appealing to sell.\n\n**2. Why it Happened?**\n\nApple scab is caused by a fungus (a tiny plant that can cause disease) that lives in the soil and on fallen leaves.  Rainy and humid weather helps the fungus spread.  If you see lots of spots on your apples *and* it's been wet and rainy lately, that's a strong sign of scab.  Think of it like a cold – you're more likely to get sick when it's wet and cold outside.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy all affected apples and leaves.  Don't compost them, as the fungus can survive.  Burn them or bury them deep in the ground.\n* **Second:**  If the infection is not too widespread, you can try a natural solution.  Mix baking soda (bicarbonate of soda) with water and spray it on the apples and leaves.  (1 tablespoon baking soda per 1 litre of water).\n* **Third:** If the problem is serious, you might need a stronger treatment.\n\n**4. How to Prevent it Next Time?**\n\n* **Clean up:**  Every autumn, rake up and remove all fallen leaves and fruit from around your apple trees. This reduces the amount of fungus that can overwinter.\n* **Good air circulation:** Prune your trees regularly to allow good air circulation. This helps to dry the leaves and fruit quickly after rain, making it harder for the fungus to grow.\n* **Watch the weather:** Pay close attention to the weather forecast. If it's going to be wet and humid for a long period, you might consider a preventative spray.\n\n**5. Treatment Options:**\n\n* **Natural:** Baking soda spray (as described above).  Almost free!\n* **Chemical:**  There are many fungicides available to treat apple scab.  Ask your local agriculture officer for recommendations.  *Always* check the label for instructions and safety precautions.  The cost will vary greatly depending on the product and quantity (₹50-₹500 per bottle, approximately).\n\n**Important Note:**  The exact cost of fungicides will depend on the brand, quantity, and where you buy them.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact details online or through your local government agricultural department]. They can provide expert advice and information on available government schemes.\n* **Local Agriculture Officer:** [Find their contact details through your local government agricultural department]. They can help identify the disease and recommend appropriate treatments.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\images.jpeg",
    "analysis": "**Advice for Farmers: Tomato Early Blight**\n\n**1. What is the Problem?**\n\nYour tomato plants have **Early Blight**.  It's a common disease that makes the leaves look sick.  You'll see dark brown or black spots, often with a target-like pattern (like a bullseye), on the leaves.  These spots can grow bigger and make the leaves turn yellow and fall off.  The spots can also appear on the stems and fruits.\n\n**2. Why it Happened?**\n\nEarly Blight is caused by a fungus that loves warm, humid weather.  It spreads easily through water splashes (rain or watering) and wind.  You might see the disease more often after periods of heavy rain or if your plants are too close together, making it hard for air to circulate.  Look for those dark spots – that's a clear sign.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy (burn if possible) any severely affected leaves or plants. This stops the fungus from spreading further.\n* **Second:** Improve air circulation.  If your plants are crowded, thin them out to give them more space.  This helps them dry faster after watering or rain.\n* **Third:** Water your plants at the base, avoiding getting water on the leaves.  This reduces the spread of the fungus.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your plants regularly for any dark spots on the leaves. Catching it early is key.\n* **Warning Signs:** Look out for warm, humid weather. This is when the fungus thrives.\n* **Prevention:** Rotate your tomato crops each year. Don’t plant tomatoes in the same spot every year.  Use disease-resistant tomato varieties if available.\n\n**5. Treatment Options:**\n\n* **Copper Oxychloride:** (Local names may vary) This is a common fungicide.  A 500g pack might cost around ₹150-₹250.  Mix as per the instructions on the pack.  Always wear gloves and a mask when using it.\n* **Natural Option:** A mixture of cow dung and water (1:10 ratio) can help to some extent. Spray this mixture on the plants weekly.  This is a cheaper and safer option, but may not be as effective as chemical treatments.\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):**  Ask your village leader or local agricultural officer for the nearest KVK's contact information.\n* **Government Help:**  Inquire at your local agricultural office about government subsidies or support for buying agricultural medicines.\n* **Local Agriculture Officer:**  Your local agricultural officer can identify the disease accurately and advise on the best treatment.\n* **Buy medicines from authorized shops:** Only buy from reputable agricultural supply stores to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.*\n\n\n**Disclaimer:** This information is for general guidance only.  Always consult with a local agricultural expert for accurate diagnosis and treatment recommendations specific to your situation.  The prices mentioned for medicines are approximate and may vary depending on location and vendor.\n",
    "label": "blight"
  },
  {
    "image_path": "test_images\\image_processing20220902-2740616-999zyq.jpg",
    "analysis": "**Mango Anthracnose: A Simple Guide for Farmers**\n\n**1. What is the Problem?**\n\nThe mangoes have **Anthracnose**, a common mango disease.  It looks like many small, dark brown or black spots scattered all over the mango skin.  Sometimes these spots grow bigger and can even cause the mango to rot. The spots affect the fruit's skin, and in severe cases, can spread to the flesh inside.\n\n**2. Why it Happened?**\n\nAnthracnose is caused by a fungus that loves warm, humid weather.  It spreads easily through rain splashes, wind, and even insects.  If you've had a lot of rain recently, or if your mangoes are crowded together with poor air circulation, the fungus has a perfect environment to grow.  You may also notice some mangoes are more affected than others, this is because some varieties are more susceptible to the disease.\n\n**3. How to Fix It?**\n\nUnfortunately, you can't cure a mango already affected by Anthracnose.  However, you can prevent it from spreading to other mangoes.\n\n* **First:** Carefully remove and destroy all the affected mangoes.  Don't leave them in the orchard; bury them deeply or burn them.\n* **Second:** Improve air circulation around your mango trees by pruning branches that are too close together.  This will help the mangoes dry faster after rain.\n* **Third:** Collect fallen leaves and fruits from the orchard floor and dispose of them properly.  These can harbor the fungus.\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Regularly check your mango trees for any signs of dark spots on the fruits or leaves.  Remove affected fruits immediately.\n* **Warning Signs:** Keep an eye out for humid weather and heavy rainfall. These conditions favor the fungus.\n\n**5. Treatment Options:**\n\nSeveral treatments can help prevent Anthracnose.  **Always consult your local agriculture officer before using any chemical treatment.**\n\n* **Natural Treatment:** A mixture of cow dung and water (1:10 ratio) sprayed on the trees can help.  This is a low-cost, readily available option.\n* **Chemical Treatment:**  Your local agriculture officer can recommend suitable fungicides.  **Examples (Note:  Local names and prices vary greatly. Always check with your local supplier):**  Some common fungicides include Mancozeb (approx. ₹150-₹300 per kg), Copper Oxychloride (approx. ₹100-₹250 per kg).  **Follow the instructions on the label carefully.**\n\n**Important Note:**  Fungicides are chemicals; use them carefully and follow safety precautions. Wear protective clothing, gloves, and a mask when applying them.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local village leader. They can provide expert advice.\n* **Government Help:**  Inquire at your local agriculture office about government subsidies or schemes for purchasing agricultural chemicals.\n* **Local Agriculture Officer:**  Your local agriculture officer can identify the problem accurately and recommend appropriate treatment.\n* **Authorized Shops:**  Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem.  For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\IMG_9277.jpeg",
    "analysis": "**Advice for Farmers: Potato Scab**\n\n**1. What is the Problem?**\n\nThe problem is **Potato Scab**.  It's a disease that makes bumpy, scabby spots appear on the potato skin.  These spots are usually rough and can be different colors, from light brown to dark brown or even reddish.  Sometimes they're just slightly raised, other times they're quite deep.  The scabs affect the potato's skin, making it look ugly and sometimes affecting the potato's quality.\n\n**2. Why it Happened?**\n\nPotato scab is caused by tiny organisms in the soil called **bacteria** (think of them as very small living things).  These bacteria thrive in warm, dry soil with a high pH (meaning it's more alkaline or less acidic).  You might see signs like cracked soil, and the potatoes themselves will show those scabby spots.  If you've had problems with scab before in a field, the bacteria might still be in the soil.\n\n**3. How to Fix It?**\n\nUnfortunately, there's no way to cure a potato already infected with scab.  The damage is done.  However, you can prevent it from spreading:\n\n* **First:** Carefully remove and discard any potatoes with severe scabbing. *Do not* put them back in the soil or use them for planting.\n* **Second:**  Clean your tools thoroughly.  The bacteria can spread from one potato to another on dirty tools.\n* **Third:**  Improve soil drainage.  Well-drained soil is less likely to have the conditions that bacteria love.  This might involve tilling or creating raised beds.\n\n**4. How to Prevent it Next Time?**\n\n* **Simple Tips:**  Plant scab-resistant potato varieties. Your local agriculture officer can advise on suitable varieties for your area.\n* **Daily/Weekly Tasks:** Rotate your crops. Don't plant potatoes in the same field year after year.  Give the soil a break.\n* **Warning Signs:** Watch for dry, cracked soil.  If your soil is very dry, water it more regularly.  Also, monitor your soil pH.  A slightly acidic soil (lower pH) is less favorable for scab bacteria.\n\n**5. Treatment Options:**\n\nThere isn't a \"cure\" for scab on already infected potatoes.  Prevention is key.  However, you can try to adjust your soil pH to make it less favorable for the bacteria.  This can be done by adding organic matter like compost or manure to the soil.  This is a natural and low-cost option.  Chemical treatments are also available but are generally expensive and require careful handling.  You should consult your local agriculture officer before using any chemical treatments.\n\n* **Natural Treatment:**  Adding compost (₹10-₹50 per kg depending on quality and location) to the soil can help improve soil structure and slightly lower the pH.\n* **Chemical Treatments:**  Some fungicides are available, but their cost and application methods vary widely.  **Always consult your local agriculture officer before using any chemical treatment.**  Prices range from ₹500 to ₹2000 per litre or kilogram depending on the product and quantity.\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):**  [Find your nearest KVK online or through local agricultural authorities.  Include contact details here if known.]\n* **Government Help:**  Many states offer subsidies on agricultural inputs, including some fungicides.  Inquire at your local agriculture office about available schemes.\n* **Local Agriculture Officers:**  [Include names and contact details of local agriculture officers if known.]\n* **Where to Buy Medicines:**  Buy medicines only from authorized agricultural input dealers.  Avoid buying from unauthorized sellers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n\nRemember, this information is for general guidance only.  Always seek professional advice from your local agriculture officer for specific recommendations tailored to your situation.\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\Keep_Garden-Header.jpg",
    "analysis": "**Advice for Farmers: Tomato Early Blight**\n\n**1. What is the Problem?**\n\nYour tomatoes have **Early Blight**.  It's a disease that makes brown, leathery spots appear on the leaves and fruits.  The spots start small and get bigger, often with a target-like pattern (concentric circles).  The leaves can turn yellow and drop off.  The tomatoes themselves get dark, sunken spots, and can rot.\n\n**2. Why it Happened?**\n\nEarly Blight is caused by a fungus that loves warm, humid weather and lives in the soil. It spreads easily through water splashing on the plants or by wind.  You might see the disease more if:\n\n* Your plants are too crowded, not getting enough air circulation.\n* There's a lot of moisture on the leaves (from rain or overhead watering).\n* You've had a lot of rain recently.\n* You're reusing soil from a previous tomato crop that had blight.\n\n**3. How to Fix It?**\n\nFirst: **Remove** any affected leaves and tomatoes.  Put them in a plastic bag and throw them away far from your garden to prevent the fungus from spreading.\n\nSecond: **Improve air circulation**. If your plants are too close, thin them out.  Try to avoid overhead watering; water at the base of the plant instead.\n\nThird: **Treat the remaining plants**. (See Treatment Options below).\n\n**4. How to Prevent it Next Time?**\n\n* **Crop Rotation:** Don't plant tomatoes in the same spot every year. Rotate your crops to different areas of your field.\n* **Cleanliness:** Remove all plant debris from the field after harvest.\n* **Spacing:** Plant tomatoes with enough space between them for good air circulation.\n* **Watering:** Water at the base of the plants to keep the leaves dry.\n* **Healthy Plants:** Use good quality seeds and seedlings to start with healthy plants.\n* **Watch for early signs:** Check your plants regularly for small brown spots on leaves or fruits.\n\n**5. Treatment Options:**\n\n* **Copper Oxychloride:** (Local names may vary; check with your local supplier).  This is a common fungicide.  Follow the instructions on the label carefully.  Approximate cost: ₹150-₹300 per kg.\n* **Mancozeb:** (Local names may vary). Another common fungicide. Follow label instructions carefully. Approximate cost: ₹200-₹400 per kg.\n* **Natural Options:**  Some farmers have success with a diluted neem oil spray (mix 2-3 tablespoons of neem oil with 1 litre of water).  This is a less effective treatment than the chemical options but is safer for the environment.  Approximate cost: ₹100-₹200 per litre.\n\n\n**Instructions for using treatments:** Always wear gloves and protective clothing when applying any chemical treatment. Follow the instructions on the product label carefully.  Mix the solution as directed and apply evenly to the plants, making sure to cover both the upper and lower surfaces of the leaves.\n\n**6. Where to Get Help:**\n\n* **Find your nearest Krishi Vigyan Kendra (KVK):** Search online for \"KVK [your district name]\"\n* **Government help:** Check with your local agricultural extension office for information on subsidies or assistance programs for purchasing plant protection materials.\n* **Local agriculture officers:** Contact your local agricultural officer for advice and guidance.  Their contact details should be available at the KVK or local government office.\n* **Buy medicines:** Purchase medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "blight"
  },
  {
    "image_path": "test_images\\Living-color-garden-center-Florida-Diagnosing-Problems-in-Your-Garden-Soil-moldy-soil-1024x512.jpg",
    "analysis": "**Advice for Farmers: Dealing with Soilborne Fungi**\n\n**1. What is the Problem?**\n\nThe image shows a problem with soil fungi.  It looks like a greyish-white fuzzy growth on the soil and plant roots. This fuzzy stuff is actually a fungus – tiny plants that live in the soil.  In this case, it appears to be a type of mold or possibly a more serious root rot.  The fungus is affecting the roots of your plants, which are underground.\n\n**2. Why it Happened?**\n\nThis fungal growth happens because of too much moisture in the soil.  Think of it like leaving bread out in a damp place – it gets moldy!  Poor drainage in your field, overwatering, or too much rain can all create the perfect conditions for these fungi to grow.  You might also see signs like wilting plants, even if you water them, and stunted growth (plants are smaller than they should be).\n\n**3. How to Fix It?**\n\nFirst: **Improve Drainage.** If water sits on the surface of your field for a long time, you need better drainage.  This might mean digging small ditches to help water flow away or improving the soil structure.\n\nSecond: **Adjust Watering.**  Water only when the soil is dry. Don't overwater.  Feel the soil with your fingers – if it's moist a few inches down, wait before watering.\n\nThird: **Remove Affected Plants (If Severe).** If the fungal growth is extensive and plants are severely affected, it's best to remove and destroy them to prevent the spread.  Do not compost these plants.\n\n**4. How to Prevent it Next Time?**\n\n* **Good Drainage:** Make sure your fields drain well.\n* **Proper Watering:** Water deeply but less frequently.\n* **Crop Rotation:** Change the types of crops you plant each year. This helps prevent the build-up of soilborne diseases.\n* **Soil Testing:** Get your soil tested regularly to check its health and drainage.\n* **Watch for Warning Signs:**  Wilting plants, even when watered, and stunted growth are early warning signs.\n\n**5. Treatment Options:**\n\n* **Natural Treatments:**  Some farmers use neem oil (locally available, cost varies, ₹50-₹200 per litre) or a solution of cow dung and water.  Mix neem oil as per instructions on the bottle.  For cow dung, mix a small amount with water and spray it around the plants.  These are not always effective against serious root rot.\n\n* **Chemical Treatments:**  There are fungicides available (costs vary greatly, ₹100-₹500 per packet).  **Always follow the instructions on the packet carefully.**  Consult your local agriculture officer for recommendations on suitable fungicides and safe application methods.  Common fungicides include those containing carbendazim or mancozeb.\n\n**Safety Note:**  This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agricultural department.]\n* **Government Help:**  [Inquire at your local agricultural office about government subsidies or assistance programs for purchasing agricultural inputs.]\n* **Local Agriculture Officer:** [Contact details should be available at your local agricultural office or panchayat.]\n* **Authorized Shops:**  Buy seeds and medicines from reputable agricultural supply stores.\n\n\n**Disclaimer:** This advice is for general information only and does not constitute professional agricultural or medical advice.  Always consult with a qualified professional for specific guidance related to your crops and situation.\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\marssonia-leaf-spot-on-euonymus-grabowski.jpg",
    "analysis": "**Advice for Farmers: Dealing with Apple Scab**\n\n**1. What is the Problem?**\n\nThe problem shown in the picture is **Apple Scab**.  It's a disease that makes the leaves and fruit of apple trees look spotty and ugly.  You'll see small, dark brown or black spots on the leaves.  These spots can grow bigger and join together, sometimes making the leaves curl up and fall off.  The spots can also appear on the fruit, making it look scabby and reducing its quality.\n\n**2. Why it Happened?**\n\nApple scab is caused by a fungus that lives in the soil and on fallen leaves.  This fungus loves wet and cool weather.  If your orchard is damp, especially during spring, the fungus will spread easily.  You might see signs like:\n\n* Lots of spots on the leaves, especially the younger ones.\n* Leaves curling and falling prematurely.\n* Spots on the fruit, making it look bumpy and ugly.\n* More problems in low-lying areas or areas with poor air circulation.\n\n\n**3. How to Fix It?**\n\nFirst: **Clean up your orchard**. Remove and destroy all fallen leaves and fruit.  This removes the fungus's hiding place.\n\nSecond: **Improve air circulation**.  Prune your trees to let air move freely between branches. This reduces humidity, making it harder for the fungus to grow.\n\nThird: **Treat the affected parts**.  (See Treatment Options below).\n\n\n**4. How to Prevent it Next Time?**\n\n* **Cleanliness is key:** Regularly remove fallen leaves and fruit.\n* **Good air circulation:** Prune your trees properly.\n* **Avoid overhead watering:** Water at the base of the tree to keep the leaves dry.\n* **Watch for early signs:** Check your trees regularly, especially during spring.\n\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  You can use fungicides like Copper Oxychloride (available at most agricultural shops).  Follow the instructions on the packaging carefully.  A typical cost is around ₹100-₹200 per kg, but prices vary.  **Always wear protective gear (gloves, mask) when using any chemical.**\n\n* **Natural Treatment:**  Some farmers use neem oil (₹150-₹300 per litre).  Dilute it according to the instructions and spray it on the leaves.  This is a less harmful option but might require more frequent applications.  You can also try baking soda spray (mix baking soda and water) as a home remedy, but its effectiveness may be limited.\n\n**Important Note:** Always follow the instructions on the packaging for any medicine you use.  Use the correct dosage and timing.\n\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):**  Ask your village leader or local agricultural officer for the nearest KVK's contact information.  They can provide expert advice and guidance.\n* **Government help:**  Inquire at your local agricultural office about subsidies or assistance programs for buying agricultural medicines.\n* **Local agricultural officer:**  Your local officer can help identify the problem and recommend appropriate treatments.\n* **Authorized shops:**  Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer. Buy medicines only from authorized shops. Follow all safety rules when using medicines. Ask for help if you're unsure about anything.*\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\MG_pathology.webp",
    "analysis": "**Advice for Farmers: Dealing with Pear Leaf Spot**\n\n**1. What is the Problem?**\n\nThe problem is **Pear Leaf Spot**, a common disease.  It makes the leaves look sick. You'll see small, round spots on the leaves.  These spots start out reddish-orange and then turn dark brown or black in the center.  The spots are mostly on the leaves, but sometimes you might see them on the fruit too.  The leaves can eventually drop off the tree early.\n\n\n**2. Why it Happened?**\n\nPear leaf spot is caused by a fungus (a tiny plant that can cause disease) that likes wet and humid weather.  It spreads easily when there's a lot of rain or dew on the leaves. Think of it like a cold spreading easily when people are close together and it's damp.  The fungus overwinters (sleeps through the winter) in fallen leaves.  If you see lots of spots on the leaves, especially in wet weather, it's a sign of this disease.\n\n\n**3. How to Fix It?**\n\nFirst: **Clean up**. Rake up and remove all fallen leaves from around your pear trees. This removes the fungus's winter home.\n\nSecond: **Improve air circulation**.  If your trees are too crowded, prune some branches to let air and sunlight reach all the leaves.  This helps the leaves dry faster, making it harder for the fungus to grow.\n\nThird: **Treat the leaves**.  (See Treatment Options below for details).\n\n\n**4. How to Prevent it Next Time?**\n\n* **Clean up fallen leaves:** Do this every autumn.\n* **Prune regularly:** Keep your trees well-spaced and pruned to improve air circulation.\n* **Water at the base:** Avoid watering the leaves directly, as this keeps them wet and encourages fungal growth.\n* **Watch for warning signs:** Keep an eye on your leaves, especially during and after rainy periods.\n\n\n**5. Treatment Options:**\n\n* **Copper-based fungicides:** These are common and relatively inexpensive.  Look for products containing copper oxychloride.  You can find these at most agricultural supply stores.  Cost: ₹100-₹300 per litre (prices vary).  *Always follow the instructions on the label carefully.*\n\n* **Natural options:**  Some farmers use neem oil (neem ka tel) as a natural fungicide.  Cost: ₹150-₹250 per litre.  *Neem oil needs to be applied regularly and may not be as effective as chemical fungicides.*\n\n* **Application:** Mix the fungicide according to the label instructions and spray it evenly on all parts of the tree, including the undersides of the leaves. Repeat the application after 10-14 days, or as directed on the product label.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Contact your local KVK for advice and information.  (Find your nearest KVK online or by asking your local agricultural officer).\n* **Government help:**  Inquire about government subsidies or schemes for purchasing agricultural inputs, including fungicides.\n* **Local agriculture officer:** Your local agriculture officer can provide expert advice and guidance.\n* **Authorized shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:*\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines (wear gloves and protective clothing).\n* Ask for help if you're unsure about anything.\n",
    "label": "leaf spot"
  },
  {
    "image_path": "test_images\\ogcpcm-b88835773z.120161108172407000g5rjm30g.10.webp",
    "analysis": "**Advice for Farmers: Citrus Fruit Splitting**\n\n**1. What is the Problem?**\n\nThe problem shown in the image is **fruit splitting** in citrus fruits, like oranges or lemons.  It looks like the fruit's peel has cracked open, sometimes revealing the inside flesh.  The splitting usually happens on the fruit itself, affecting its appearance and making it more prone to rot and pests.\n\n**2. Why it Happened?**\n\nFruit splitting is often caused by **irregular watering**.  Think of it like this: if you give the tree too much water all at once after a dry spell, the fruit swells up quickly, and its skin can't keep up, causing it to crack.  Other causes include:\n\n* **Sudden changes in weather:**  Going from very dry to very wet conditions quickly can also cause splitting.\n* **Nutrient imbalances:** Lack of certain nutrients can weaken the fruit's skin.\n* **Pest damage:** Sometimes, pests might initially damage the fruit, making it more prone to splitting later.  Look for small holes or other signs of insect activity.\n\n**3. How to Fix It?**\n\nUnfortunately, you can't fix already split fruit.  It's best to harvest and use them quickly before they rot.  Focus on preventing further splitting:\n\n* **First:**  Check your watering schedule.  Aim for consistent, moderate watering instead of infrequent, heavy watering.\n* **Second:**  Observe your soil.  If it's poorly drained, improve drainage by adding organic matter like compost.\n* **Third:**  Get your soil tested (at your local KVK) to check for nutrient deficiencies.\n\n**4. How to Prevent it Next Time?**\n\n* **Consistent watering:** Water deeply but less frequently, allowing the soil to dry slightly between waterings.\n* **Mulching:** Apply a layer of mulch (like straw or dried leaves) around the base of the trees to retain moisture and regulate soil temperature.\n* **Regular monitoring:** Check your trees and fruits regularly for any signs of splitting or pest damage.\n\n**5. Treatment Options:**\n\nThere are no direct treatments for fruit splitting itself.  Focus on preventing it by addressing the underlying causes.  However, if pests are involved, you might need treatment:\n\n* **Neem oil:** A natural pesticide, available at most agricultural shops for around ₹100-₹200 per litre.  Dilute as per instructions on the label.\n* **Chemical pesticides:** Your local agriculture officer can recommend suitable pesticides if pests are a significant problem.  Prices vary greatly depending on the product.  **Always follow instructions carefully.**\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agricultural department.]\n* **Government help:**  Inquire at your local KVK or agricultural office about government subsidies or schemes for purchasing agricultural inputs.\n* **Local agriculture officer:** [Find their name and contact information through your local agricultural department.]\n* **Authorized shops:** Buy pesticides and other agricultural inputs only from authorized dealers to ensure quality and safety.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n* Show this information to your local agriculture officer.\n* Buy medicines only from authorized shops.\n* Follow all safety rules when using medicines.\n* Ask for help if you're unsure about anything.\n",
    "label": "rot"
  },
  {
    "image_path": "test_images\\plant_disease.jpg",
    "analysis": "I cannot provide advice based on the image because it is blank.  To help farmers, I need a picture of the affected plant showing the disease symptoms.  Please provide a picture of the plant showing the problem.\n\n\nOnce you provide the image, I will be able to give you specific advice following the guidelines you provided, including:\n\n* Identifying the disease in simple terms.\n* Explaining the cause and visible signs.\n* Suggesting step-by-step solutions, starting with low-cost options.\n* Providing prevention tips and easy-to-follow tasks.\n* Listing treatment options (chemical and natural), including approximate costs in Indian Rupees (₹), and safe usage instructions.\n* Giving information on where to seek help (KVK, government assistance, local agriculture officers, and authorized medicine sellers).\n\n\nRemember, always consult your local agriculture officer for personalized advice and safe practices.\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\PX8Qkw9zJbrQPgYGoYUzPF.jpg",
    "analysis": "**Advice for Farmers: Dealing with Root Knot Nematodes**\n\n**1. What is the Problem?**\n\nThe problem shown in the image is **Root Knot Disease**.  It's caused by tiny worms called **nematodes** (imagine tiny, invisible threads) that live in the soil.  They attack the roots of plants.  You won't see the nematodes easily, but you'll see the damage they cause.\n\nThe roots will have swollen, bumpy areas, like little knots or galls.  These knots are where the nematodes are feeding.  The plant may look weak, not grow well, and may not produce a good harvest.  The affected parts are the roots, but the whole plant suffers because the roots can't get water and nutrients properly.\n\n\n**2. Why it Happened?**\n\nRoot knot disease happens because of these tiny nematodes in the soil.  They are always present in the soil to some extent, but certain conditions make them multiply and cause problems.  These include:\n\n* **Infected soil:** Using soil that already has these nematodes.  Think of it like planting seeds in soil already full of unwanted weeds.\n* **Warm weather:** Nematodes love warm soil.\n* **Poor soil drainage:** Wet, poorly drained soil creates a good environment for them.\n* **Using the same crop repeatedly:** Planting the same type of crop in the same field year after year without proper soil management can increase the nematode population.\n\n**Signs you can easily spot:**  Weak plants, stunted growth, and those tell-tale root knots.  If you pull up a plant and see swollen, bumpy roots, that's a strong sign.\n\n\n**3. How to Fix It?**\n\nThis is a tricky problem, and there's no quick fix.  Here's what to do:\n\n* **First:**  Remove and destroy any severely infected plants.  Don't compost them; throw them away far from your field.\n* **Second:**  Improve soil drainage.  Make sure your field isn't waterlogged.  This might involve digging drainage ditches or improving soil structure.\n* **Third:**  Consider crop rotation.  Plant a non-host crop (like marigolds or certain grasses) for a season or two to help reduce the nematode population.\n\n**4. How to Prevent it Next Time?**\n\n* **Crop rotation:**  This is the most important step.  Alternate your crops every year.\n* **Soil solarization:**  Cover the soil with clear plastic during the hottest part of the year to kill nematodes with the sun's heat.\n* **Resistant varieties:**  Choose plant varieties that are known to be more resistant to root knot nematodes.  Ask your local agriculture officer for advice.\n* **Regular soil testing:** Get your soil tested regularly to check for nematode levels.\n\n\n**5. Treatment Options:**\n\n* **Chemical nematicides:**  These are available, but they can be expensive (₹500-₹2000 per litre depending on the product and quantity) and harmful to the environment if not used carefully.  **Always follow instructions carefully and wear protective gear.**  Your local agriculture officer can advise on safe and appropriate nematicides.\n* **Natural methods:**  Some farmers use neem cake (₹50-₹100 per kg) as a soil amendment.  It helps improve soil health and can have some effect on nematodes.  Marigold plants are also known to repel nematodes.\n\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK online or ask your village leader.  They can provide advice and soil testing.\n* **Government help:**  Some government schemes offer subsidies on agricultural inputs, including nematicides.  Check with your local agriculture officer.\n* **Local agriculture officer:**  They can identify the problem, recommend solutions, and help you access government schemes.\n* **Authorized shops:**  Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please:*\n\n* *Show this information to your local agriculture officer*\n* *Buy medicines only from authorized shops*\n* *Follow all safety rules when using medicines*\n* *Ask for help if you're unsure about anything*\n",
    "label": "nematode"
  },
  {
    "image_path": "test_images\\red-rust-disease-in-mango.jpg",
    "analysis": "**Mango Anthracnose: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nYour mango trees have *Anthracnose*, a common disease.  It looks like rusty-orange or brown spots on the leaves, flowers, and fruits.  These spots can grow bigger and make the fruit rot.  The leaves might also look scorched or dried.\n\n\n**2. Why it Happened?**\n\nAnthracnose is caused by a fungus that loves warm, humid weather and rainy seasons.  It spreads easily through rain splashes and wind.  You'll see the rusty spots first on leaves, then on flowers, and finally on the fruits.  If you see many spots, especially during or after rainy periods, it's likely Anthracnose.\n\n\n**3. How to Fix It?**\n\n* **First:** Remove all affected leaves, flowers, and fruits.  Collect them carefully and burn them or bury them deep in the ground to stop the fungus from spreading.\n\n* **Second:**  Clean the orchard floor. Remove weeds and fallen leaves.  Good air circulation helps prevent the fungus.\n\n* **Third:**  Start treating the tree.\n\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly Tasks:** Regularly check your trees for any spots or unusual discoloration.  Remove affected parts immediately.\n\n* **Warning Signs:**  Keep an eye out for rusty spots, especially after rain or during humid weather.  If you see even a few, take action quickly.\n\n* **Good orchard management:** Ensure proper spacing between trees for good air circulation. Avoid overhead irrigation.\n\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  A mixture of cow dung and water (1:10 ratio) sprayed on the leaves and fruits can help.  This is cheap and readily available.\n\n* **Chemical Treatment (Use with caution and always follow instructions):**  There are many fungicides available.  Ask your local agriculture officer for recommendations.  Some common ones include:\n\n    * **Copper Oxychloride:** (Cost varies, check local prices.  Usually ₹100-₹300 per kg)  Mix as per instructions on the packet.\n    * **Mancozeb:** (Cost varies, check local prices. Usually ₹150-₹350 per kg) Mix as per instructions on the packet.\n\n**Important:** Always wear protective gear (gloves, mask) when applying chemical treatments.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK online or ask your local village officer.\n* **Government Help:**  Many government schemes offer subsidies on agricultural inputs.  Check with your local agriculture department.\n* **Local Agriculture Officer:**  They can identify the problem and suggest the best treatment.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\shutterstock-1809969313.jpg",
    "analysis": "**Advice for Farmers: Dealing with Leaf Spot Disease**\n\n**1. What is the Problem?**\n\nYour plants have a leaf spot disease.  It's like giving your leaves a bad case of freckles! You'll see small, round spots on the leaves.  These spots might be different colors – maybe yellowish, brownish, or even black – and sometimes have a darker border.  The spots can be scattered all over the leaves, affecting the whole plant.\n\n**2. Why it Happened?**\n\nLeaf spot is usually caused by fungi or bacteria.  These tiny organisms love damp, humid conditions.  Think of it like this: if your clothes stay wet for too long, they get moldy, right?  The same thing happens to plants.  Too much rain, poor air circulation (plants too crowded), or watering from above (getting the leaves wet) can create the perfect environment for these organisms to grow.  You might also see signs like:\n\n* Spots starting small and growing bigger\n* Leaves turning yellow and dropping off\n\n**3. How to Fix It?**\n\nFirst, remove any severely affected leaves.  This stops the disease from spreading.  Second, improve air circulation by thinning out crowded plants.  Give them more space to breathe.  Third, change how you water.  Water at the base of the plant, not from above, to keep the leaves dry.\n\n**4. How to Prevent it Next Time?**\n\n* **Cleanliness is key:** Remove fallen leaves and plant debris regularly.  This removes hiding places for the fungus or bacteria.\n* **Proper spacing:** Plant your crops with enough space between them for good air circulation.\n* **Watering wisely:** Water only when the soil is dry, and always water at the base of the plants.\n* **Watch for warning signs:** Regularly inspect your plants for any unusual spots or discoloration on the leaves.\n\n\n**5. Treatment Options:**\n\n* **Natural Treatment:**  A simple solution of baking soda (1 teaspoon) and water (1 litre) can help. Spray this on the leaves, making sure to cover both sides.  This is very cheap (₹10-₹20 for baking soda).\n* **Chemical Treatment:**  Your local agricultural officer can recommend a suitable fungicide (a medicine that kills fungi).  The cost will vary (₹100-₹500 per bottle, depending on the type and quantity).  *Always follow the instructions on the label carefully.*\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n\n\n**6. Where to Get Help:**\n\nFind your nearest Krishi Vigyan Kendra (KVK) by searching online or asking at your local agricultural office.  They can provide more specific advice and help you find suitable treatments.  The government often offers subsidies on agricultural inputs, including medicines.  Ask your local agriculture officer about these programs.  Buy medicines only from authorized agricultural shops to ensure they are safe and effective.\n",
    "label": "leaf spot"
  },
  {
    "image_path": "test_images\\shutterstock-1809969313.webp",
    "analysis": "Hello Farmers!\n\nLet's talk about the problem shown in the picture.  It looks like your plants have a fungal leaf spot disease.\n\n**1. What is the Problem?**\n\nThe problem is a type of leaf spot disease, likely caused by a fungus.  Think of it as tiny pimples or spots on the leaves.  These spots start small, often yellowish or light green, then turn darker, sometimes black or brown, with a powdery or crusty look.  The spots are mostly on the leaves, but sometimes they can affect stems too.  They look like small, round or irregular patches.\n\n**2. Why it Happened?**\n\nThis fungal disease happens because of damp, humid weather.  Fungi love moisture!  If your plants are crowded, or if there's not enough air circulation, the leaves stay wet for longer, making it easier for the fungus to grow.  Think of it like a damp towel – it's the perfect place for mold (fungus) to grow. You might also see signs like:\n\n* Lots of spots on the leaves, getting bigger and more numerous.\n* Leaves turning yellow and falling off.\n* Reduced plant growth.\n\n**3. How to Fix It?**\n\nFirst, remove all the badly affected leaves.  Collect them and burn them or bury them deep so the fungus doesn't spread.  Second, improve air circulation around your plants.  This means spacing them out so they aren’t crowded.  Third, try a simple, low-cost solution:\n\n* **Make a natural spray:** Mix 1 tablespoon of baking soda with 1 litre of water. Add a tiny bit of dish soap (a few drops) to help it stick to the leaves. Spray this mixture on the plants, making sure to cover all the leaves, especially the undersides.  Repeat every 3-4 days for 2-3 weeks.\n\n**4. How to Prevent it Next Time?**\n\n* **Good air circulation:**  Space your plants properly.\n* **Avoid overhead watering:** Water at the base of the plants to keep the leaves dry.\n* **Cleanliness:** Remove fallen leaves regularly.\n* **Watch for early signs:** Check your plants regularly for small spots.  Early detection is key!\n\n**5. Treatment Options:**\n\n* **Natural:** Baking soda spray (as described above – costs almost nothing!).\n* **Chemical:**  You can use a fungicide, but only buy from authorized shops.  Ask your local agriculture officer for recommendations and the correct dosage.  Prices vary greatly depending on the brand and quantity (₹50-₹500 per bottle, approximately).  Always follow the instructions carefully.\n\n**Safety Note:**  Always wear gloves and protective clothing when using any type of spray.  Keep children and animals away from treated plants.\n\n**6. Where to Get Help?**\n\n* **Find your nearest Krishi Vigyan Kendra (KVK):**  Search online for \"KVK [your district name]\" to find their contact details.\n* **Government help:**  Inquire at your local KVK or agriculture office about government subsidies or schemes for purchasing agricultural inputs.\n* **Local agriculture officer:**  Your local agriculture officer can provide specific advice and guidance.  Ask your village head or local panchayat for their contact information.\n* **Authorized shops:**  Buy medicines only from registered agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:** This advice is for general understanding. Always consult your local agriculture officer before taking any action.  Buy medicines only from authorized shops, follow all safety instructions carefully, and seek help if you are unsure about anything.\n",
    "label": "leaf spot"
  },
  {
    "image_path": "test_images\\tomatoes-get-sick-by-late-blight-phytophthora-e1637357783833.jpg",
    "analysis": "**Simple Advice for Farmers: Tomato Early Blight**\n\n**1. What is the Problem?**\n\nYour tomatoes have **Early Blight**.  It's a disease that makes dark brown or black spots appear on the leaves and fruits.  The spots start small, like freckles, but get bigger and can rot the tomatoes.  The leaves also turn brown and dry out, sometimes with a target-like pattern on the spots.  Both leaves and fruits are affected.\n\n**2. Why it Happened?**\n\nEarly Blight is caused by a fungus that loves warm, humid weather. It spreads easily through water splashes (rain or watering) and wind.  If you've had a lot of rain lately, or if your plants are crowded and don't get enough air circulation, the fungus has a perfect environment to grow.  You might also see the fungus as a dark, fuzzy growth on the leaves.\n\n**3. How to Fix It?**\n\nFirst: **Remove and destroy** all affected leaves and tomatoes.  Burn them or bury them deep in the ground to stop the fungus from spreading.\n\nSecond: **Improve air circulation**.  If your plants are too close together, thin them out to allow more air to reach all parts of the plants.\n\nThird: **Water at the base of the plants**, avoiding wetting the leaves.  This reduces the spread of the fungus.\n\n**4. How to Prevent it Next Time?**\n\n* **Crop rotation:** Don't plant tomatoes in the same place every year. Rotate your crops to different areas of your field.\n* **Cleanliness:** Remove all plant debris from the field after harvest to reduce the fungus's chances of surviving.\n* **Spacing:** Plant tomatoes with enough space between them for good air circulation.\n* **Healthy starts:** Use disease-free seedlings.\n* **Watch for warning signs:** Check your plants regularly for small brown spots on leaves or fruits – early detection is key.\n\n\n**5. Treatment Options:**\n\n* **Copper Oxychloride:** (Available locally, ask for *Taamra Oxychloride*).  This is a common fungicide.  Cost: ₹100-₹200 per 100g (prices vary).  Follow instructions on the label carefully.  Mix as directed and spray the plants thoroughly, covering all leaves and fruits. Repeat every 7-10 days if needed.\n* **Natural option:**  A mixture of cow dung and water (1:10 ratio) can help to some extent. Spray this on the plants regularly.  This is a low-cost, eco-friendly option, but may not be as effective as chemical treatments.\n\n**Safety Note:**  Always wear gloves and protective clothing when using any chemical treatment. Wash your hands and clothes thoroughly after use.\n\n**6. Where to Get Help:**\n\n* Find your nearest Krishi Vigyan Kendra (KVK) online or by asking your local village leader. They can provide expert advice and support.\n* Check with your local agriculture officer (contact details available at your local KVK or Panchayat office) about government subsidies or assistance for buying medicines.\n* Buy medicines only from authorized agricultural input dealers to ensure they are safe and genuine.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "blight"
  },
  {
    "image_path": "test_images\\v8.jpeg",
    "analysis": "**Citrus Greasy Spot: Simple Advice for Farmers**\n\n**1. What is the Problem?**\n\nThe problem is called \"Greasy Spot\".  It's a disease that makes the fruit and leaves of your citrus trees (like oranges, lemons, and grapefruits) look sick.  The fruits get dark, oily-looking spots, a bit like grease stains. The leaves also get similar spots and may become slightly curled.  The spots mostly appear on the fruit and leaves.\n\n**2. Why it Happened?**\n\nGreasy spot is caused by a tiny fungus that likes warm, humid weather.  It spreads easily when there's a lot of rain and dew, especially in shady areas.  You'll see it more often in the rainy season.  If you notice many spots on the leaves and fruit, and the weather has been wet and humid, that's a good sign of greasy spot.  Think of it like a fungus spreading easily in damp conditions, similar to how mold grows in a damp room.\n\n**3. How to Fix It?**\n\nFirst:  If the problem is only on a few fruits, you can just remove and discard the affected fruits. This prevents the fungus from spreading further.\n\nSecond: Improve air circulation around your trees.  This means pruning branches to let sunlight and air reach all parts of the tree.  This helps to dry the leaves and fruit faster, making it harder for the fungus to grow.\n\nThird:  If the problem is widespread, you'll need to use a treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Pruning:** Regularly prune your trees to improve air circulation. Do this during the dry season.\n* **Watering:** Avoid overhead watering (watering from above). Water at the base of the tree instead.\n* **Spacing:** Ensure your trees are properly spaced to allow good air circulation.\n* **Watch the weather:** Be extra vigilant during and after periods of heavy rain and humidity.\n\n**5. Treatment Options:**\n\n* **Copper-based fungicides:** These are commonly available.  Ask your local agriculture officer for recommendations.  Look for products containing copper oxychloride.  The cost can vary from ₹100-₹500 per litre, depending on the brand and concentration.  Always follow the instructions on the label carefully.\n* **Natural options:** Some farmers use neem oil (₹150-₹300 per litre) as a preventative measure.  It's not as effective as copper fungicides against established greasy spot, but it can help reduce the spread.  Mix as per the instructions on the label.\n\n**Instructions for using treatments:**\n\n* Always wear protective gloves and clothing when applying any treatment.\n* Mix the fungicide or neem oil according to the label instructions.\n* Spray the solution evenly on all parts of the tree, including the leaves and fruits.\n* Repeat the application as recommended on the product label.\n\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):** Search online or ask your village leader for the nearest KVK. They can provide expert advice and guidance.\n* **Government help:** Check with your local agriculture department for subsidies or assistance programs for purchasing agricultural medicines.\n* **Local agriculture officer:** Your village or block will have an agriculture officer. They can identify the problem and recommend appropriate treatments.\n* **Authorized shops:** Buy medicines only from registered agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "greasy spot"
  },
  {
    "image_path": "test_images\\What_is_Fruit_Rot_Disease_efb7816c42.webp",
    "analysis": "**Advice for Farmers: Dealing with Tomato Early Blight**\n\n**1. What is the Problem?**\n\nThe problem is **Early Blight**, a common disease affecting tomatoes.  It makes dark brown or black spots appear on the leaves and fruits.  The spots often have a target-like pattern (like a bullseye).  The spots start small but grow bigger, and they can cause the leaves to dry up and fall off.  The tomatoes themselves get ugly brown spots, making them rot and unusable.\n\n**2. Why it Happened?**\n\nEarly Blight is caused by a fungus that loves warm, humid weather.  It spreads easily through water splashes from rain or watering.  The fungus lives in the soil and on old plant debris, so it can easily infect new plants.  You might see the dark spots on older leaves first, spreading to newer ones and the fruit.  If your field is poorly drained and stays wet for long periods, that creates perfect conditions for the fungus to thrive. Think of it like a damp towel left in a warm place – it's perfect for mold to grow, just like this fungus.\n\n**3. How to Fix It?**\n\nFirst: **Remove and destroy** any affected leaves and tomatoes.  Don't compost them; put them in a plastic bag and throw them away. This stops the fungus from spreading.\n\nSecond: **Improve air circulation**.  Make sure your plants aren't too crowded.  This helps them dry quickly after watering or rain.\n\nThird: **Water at the base of the plants**, not overhead.  This prevents water from splashing onto the leaves and spreading the fungus.\n\n**4. How to Prevent it Next Time?**\n\n* **Crop rotation:** Don't plant tomatoes in the same spot every year.  Rotate your crops to break the disease cycle.\n* **Clean up:** Remove all old tomato plants and debris from the field after harvest.  This removes the fungus's home.\n* **Good drainage:** Make sure your field drains well to avoid waterlogging.\n* **Healthy plants:**  Healthy plants are more resistant to disease.  Make sure your plants get enough water and nutrients.  Check for any nutrient deficiencies.\n* **Watch for warning signs:** Look for those dark spots on the leaves early on.  Early detection is key!\n\n**5. Treatment Options:**\n\n* **Copper oxychloride:** (Local names may vary; check with your local supplier). This is a common fungicide.  A 500g pack might cost around ₹150-₹250.  Always follow the instructions on the label carefully.\n* **Mancozeb:** (Local names may vary). Another effective fungicide.  Pricing varies depending on the quantity.\n* **Natural options:** Some farmers use neem oil or a mixture of cow dung and water as a natural spray.  These are less effective than chemical options but can help if used early.  Neem oil can cost around ₹100-₹200 per litre.\n\n**Important:**  Always dilute fungicides according to the label instructions. Wear protective clothing like gloves and masks when applying them.\n\n**6. Where to Get Help?**\n\n* **Find your local Krishi Vigyan Kendra (KVK):** Contact information can be found online or at your local agricultural office.\n* **Government subsidies:** Check with your local agricultural officer about government schemes that might help you buy medicines at a lower cost.\n* **Local agriculture officer:** They can identify the disease properly and recommend the best treatment.\n* **Authorized shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "blight"
  },
  {
    "image_path": "test_images\\White blister Figure 7.jpeg",
    "analysis": "**Advice for Farmers: Broccoli Problem**\n\n**1. What is the Problem?**\n\nThe problem looks like your broccoli is going to seed (or bolting).  Instead of forming tight, green heads, the broccoli is producing small, flower-like buds.  This affects the whole head of the broccoli, making it unsuitable for sale or eating.\n\n**2. Why it Happened?**\n\nBroccoli bolting happens when the plant gets stressed.  This can be due to several things:\n\n* **Heat Stress:**  Too much hot weather can trigger the plant to flower early.  Think of it like the plant trying to reproduce before it dies from the heat.\n* **Cold Stress:**  Surprisingly, very cold weather can also cause bolting.\n* **Long Days:**  Broccoli needs a certain number of hours of daylight to grow properly.  If the days get too long, it might start flowering.\n* **Poor Soil:**  Lack of nutrients in the soil, especially nitrogen, can also cause stress and lead to bolting.\n\n\n**3. How to Fix It?**\n\nUnfortunately, once bolting has started, you can't really reverse it for that head of broccoli.  The head will continue to flower, and the quality will not improve.  You can still harvest the head, but it won't be as valuable.\n\n**4. How to Prevent it Next Time?**\n\n* **Choose the right variety:** Select broccoli varieties that are suited to your local climate and day length.  Ask your local agriculture officer or seed supplier for recommendations.\n* **Plant at the right time:**  Plant your broccoli during the cooler months when the days are shorter. This will help prevent early bolting.\n* **Water regularly:** Consistent watering helps prevent stress. Avoid both overwatering and underwatering.\n* **Fertilize properly:** Use a balanced fertilizer that is rich in nitrogen.  Follow the instructions on the fertilizer packaging carefully.\n* **Mulch:**  Use mulch (like straw or dried leaves) around the plants to help keep the soil cool and moist.\n* **Monitor temperature:** Watch the weather forecast and take steps to protect your plants from extreme heat or cold if necessary (e.g., shade cloth for heat, row covers for frost).\n\n**5. Treatment Options:**\n\nThere's no cure for bolting once it's started.  Focus on prevention.\n\n**6. Where to Get Help:**\n\n* **Find your local Krishi Vigyan Kendra (KVK):** Search online for \"KVK [your district name]\" to find their location and contact information.\n* **Government Help:**  Inquire at your local KVK or agricultural office about government subsidies or programs that might help you buy seeds or fertilizers.\n* **Local Agriculture Officer:** Ask your village head or local panchayat for the contact information of your local agriculture officer.\n* **Buy medicines from authorized shops:** Only buy seeds and fertilizers from reputable agricultural supply stores.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "unknown disease"
  },
  {
    "image_path": "test_images\\white-blister-broccoli-oospores.png",
    "analysis": "**Advice for Farmers: Broccoli Problem**\n\n**1. What is the Problem?**\n\nThe problem looks like a fungal disease affecting your broccoli.  We call it \"Downy Mildew\" but you can just think of it as a *leaf and head spot*.  The broccoli heads and leaves have white, powdery spots, and the leaves might be curled or distorted.  The spots start small and spread, making the broccoli look unhealthy and affecting the whole head.\n\n**2. Why it Happened?**\n\nThis happens because of a fungus that likes damp, cool weather.  It spreads easily when there's a lot of moisture (rain or dew) and the temperature isn't too hot.  Think of it like a cold that spreads easily when people are close together and it's damp.  You might see the white, powdery spots first on the leaves and then it spreads to the broccoli head.\n\n**3. How to Fix It?**\n\n* **First:** Remove and destroy any badly affected plants.  Don't compost them, as the fungus can survive.  Burn them or bury them deep.\n* **Second:** Improve air circulation.  Make sure your broccoli plants aren't too crowded.  Thin them out if needed.  This helps them dry faster after rain or watering.\n* **Third:** Use a fungicide.  (See Treatment Options below)\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your plants regularly for any signs of white spots or leaf curling.  Early detection is key.\n* **Important Warning Signs:** White powdery spots on leaves, distorted leaves, and stunted growth.  If you see these, take action quickly.\n* **Prevention:** Plant broccoli in well-drained soil.  Avoid overhead watering (watering from above) to keep the leaves dry.  Rotate your crops each year to prevent the fungus from building up in the soil.\n\n**5. Treatment Options:**\n\n* **Chemical:**  Mancozeb ( ₹ 150-250 per 500g).  Follow the instructions on the packet carefully.  Mix the correct amount with water and spray evenly on the plants, covering all leaves and heads.  Repeat every 7-10 days as needed.\n* **Natural:**  A mixture of baking soda (1 teaspoon) and water (1 liter) can help.  Spray this on the plants regularly.  Cow urine (diluted) can also help.  Note: Natural remedies may need more frequent applications.\n\n**Safety Note:** Always wear gloves and protective clothing when using any chemical or natural treatment. Wash your hands thoroughly after use.\n\n**6. Where to Get Help?**\n\n* **Local Krishi Vigyan Kendra (KVK):**  [Find your nearest KVK online or through your local agricultural department]. Call them for advice and information.\n* **Government Help:**  Many state governments offer subsidies on agricultural inputs, including fungicides. Check with your local agricultural department for details.\n* **Local Agriculture Officer:** [Find contact information through your local government website or village head].\n* **Genuine Medicines:** Buy medicines only from authorized agricultural input dealers.  Avoid buying from unknown sources.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "mildew"
  },
  {
    "image_path": "test_images\\1107_0.webp",
    "analysis": "**Advice for Passion Fruit Farmers: Dealing with Passion Fruit Brown Spot**\n\n**1. What is the Problem?**\n\nThe problem shown in the picture is **Passion Fruit Brown Spot**.  It's a disease that makes brown or yellowish-brown spots appear on the passion fruit. These spots are often surrounded by a darker ring.  The spots start small but can grow bigger, covering much of the fruit's skin.  The fruit itself might become misshapen and not grow to its full size.\n\n**2. Why it Happened?**\n\nPassion Fruit Brown Spot is caused by a fungus (a tiny plant that can cause disease).  This fungus loves warm, humid weather and thrives when there's not enough air circulation around the plants.  Poor drainage in the soil also helps the fungus grow. You might see the spots first on the younger fruits.  If you notice many spots on the leaves, that's another sign.\n\n**3. How to Fix It?**\n\nFirst: **Remove and destroy** any affected fruits immediately.  Don't leave them on the plant or on the ground.  Burn them or bury them deep to stop the fungus from spreading.\n\nSecond: **Improve air circulation**.  Prune your passion fruit plants to open them up and let the air flow through.  Avoid overcrowding the plants.\n\nThird: **Improve drainage**. Make sure the soil drains well. If the soil is too wet, add organic matter like compost to improve drainage and soil health.\n\n**4. How to Prevent it Next Time?**\n\n* **Regular pruning:** Prune your plants regularly to improve air circulation. Do this every few weeks, removing any dead or diseased branches.\n* **Spacing:** Plant your passion fruit vines with enough space between them. This helps air to circulate and reduces humidity.\n* **Watering:** Water your plants at the base, avoiding wetting the leaves. Water only when the soil is dry.\n* **Watch for warning signs:** Regularly check your plants for any spots on the leaves or fruits. Early detection is key.\n\n**5. Treatment Options:**\n\nSeveral treatments can help, but always use them safely.  Always follow the instructions on the product label.\n\n* **Copper-based fungicides:** These are common and relatively inexpensive.  Look for products containing copper oxychloride.  (Cost: ₹100-₹300 per 500g, prices vary by brand and location).  Mix as per the instructions on the packet.  Apply to the leaves and fruits using a sprayer.\n* **Natural remedies:** Some farmers use a mixture of cow urine and water (1:10 ratio) as a natural fungicide.  Apply this regularly to the plants.  There is no cost for this solution.\n\n**Safety Note:** Always wear protective clothing (gloves, mask) when using chemical treatments. Wash your hands thoroughly after use.\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):** Contact your local KVK for advice and information.  (Find your nearest KVK online or through your local agricultural department).\n* **Government help:** Check with your local agricultural department about government subsidies or schemes for purchasing agricultural inputs, including fungicides.\n* **Local agriculture officers:** Your local agricultural officer can provide valuable advice and guidance.\n* **Authorized shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:**  This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "brown spot"
  },
  {
    "image_path": "test_images\\5602588.jpg",
    "analysis": "**Advice for Farmers: Dealing with Cucumber Downy Mildew**\n\n**1. What is the Problem?**\n\nThe problem is **Cucumber Downy Mildew**.  It's a disease that makes your cucumbers look sick.  You'll see a fuzzy, grayish-white mold growing on the leaves and fruits (cucumbers).  The cucumbers themselves might have yellow or brown spots and look rotten.  The disease mainly affects the leaves and the fruits.\n\n**2. Why it Happened?**\n\nDowny mildew happens because of a tiny fungus that loves damp, humid weather.  It spreads easily when it's rainy or foggy, and when there's not enough sunlight.  You might see it more often after a period of heavy rain or dew.  Look for the fuzzy, grayish-white mold – that's a clear sign.  If you see it on one plant, it can quickly spread to others.\n\n**3. How to Fix It?**\n\nFirst: **Remove** any affected leaves and cucumbers.  Don't compost them; throw them away or burn them to stop the disease from spreading.\n\nSecond: **Improve air circulation**. Make sure your plants aren't too crowded.  If they are, thin them out to allow more air to move between them.\n\nThird: **Treat the plants**. (See Treatment Options below)\n\n**4. How to Prevent it Next Time?**\n\n* **Plant resistant varieties:** Ask your local seed supplier for cucumber varieties that are resistant to downy mildew.\n* **Good spacing:** Give your cucumber plants enough space so air can circulate easily. Don't overcrowd them.\n* **Water early in the day:** Water your plants in the morning so the leaves dry quickly before evening.  Avoid overhead watering.\n* **Crop rotation:** Don't plant cucumbers in the same place every year.  Rotate your crops to break the disease cycle.\n* **Cleanliness:** Remove any plant debris after harvest to reduce the chances of the fungus surviving.\n* **Watch for warning signs:** Keep an eye out for the fuzzy white mold.  Early detection is key.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  You can use copper oxychloride (available at most agricultural stores).  The cost varies greatly depending on the quantity and brand, but expect to pay anywhere from ₹50 to ₹300 per packet.  Always follow the instructions on the packet carefully.\n* **Natural Treatment:**  A mixture of baking soda (1 teaspoon) and liquid soap (1 teaspoon) in 1 liter of water can sometimes help. Spray this mixture on the plants, making sure to cover all the leaves.  This is a low-cost option.\n\n**Important Note:**  Always use these treatments according to the instructions.  Wear gloves and protective clothing when applying chemical treatments.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking your local agricultural officer.\n* **Government Help:**  Inquire at your local agricultural office about government schemes for subsidized pesticides.\n* **Local Agriculture Officer:**  Your local agricultural officer can provide specific advice and guidance.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine and safe products.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "mildew"
  },
  {
    "image_path": "test_images\\6f66ee666c3cabc6b2b6331ffd4f12f3.jpeg",
    "analysis": "**Advice for Farmers: Sooty Mold on Citrus**\n\n**1. What is the Problem?**\n\nThe problem is **Sooty Mold**.  Imagine a dark, sooty film covering your lemon tree's leaves and fruit. That's sooty mold. It looks like black or dark grey dust or spots on the leaves and sometimes the fruit.  The leaves and fruits are affected, making them look dirty and less appealing.\n\n**2. Why it Happened?**\n\nSooty mold isn't a disease itself, but a *symptom*.  It grows on the sticky honeydew left behind by tiny insects like aphids, whiteflies, or mealybugs. These insects suck the sap from your lemon tree, leaving behind this sugary substance.  Think of it like a sugary spill that encourages the mold to grow. You'll see these tiny insects crawling on the leaves and branches, and you might also notice the sticky honeydew.\n\n**3. How to Fix It?**\n\nFirst, deal with the insects causing the problem.  Second, clean the sooty mold. Third, monitor for re-infestation.\n\n* **First:** Gently wash the leaves with water to remove the honeydew and some of the mold. You can use a soft cloth or a spray bottle.  If the infestation is heavy, you might need to use a mild soap solution (like neem soap – see below).\n\n* **Second:** After washing, the sooty mold should be less visible.  If it persists, you can try a stronger solution (see Treatment Options).\n\n* **Third:** Keep checking your lemon tree regularly for insects and the return of honeydew.\n\n**4. How to Prevent it Next Time?**\n\n* **Regular Inspection:** Check your lemon tree weekly for any insects.\n* **Healthy Plants:** Strong, healthy plants are less likely to be attacked by insects.  Make sure your trees get enough water and nutrients.\n* **Natural Predators:** Encourage natural enemies of aphids and whiteflies, like ladybugs, by planting flowers that attract them.\n\n**5. Treatment Options:**\n\n* **Neem Oil (Locally available):**  A natural pesticide.  ₹100-₹300 per 100ml bottle. Mix as per instructions on the bottle.  Always wear gloves and follow safety instructions.\n* **Insecticidal Soap:** Another natural option, relatively inexpensive. ₹50-₹200 per 100ml bottle.  Mix as per instructions on the bottle.\n* **Chemical Insecticides (Consult your agriculture officer):**  Only use these if natural methods fail.  These can be more expensive and harmful to the environment if not used correctly.  Prices vary greatly.  **Always follow instructions carefully and wear protective gear.**\n\n**6. Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agricultural department.]\n* **Government Help:**  Inquire at your local agricultural office about subsidies or assistance programs for purchasing pesticides.\n* **Local Agriculture Officer:** [Find their contact information through your local government website or agricultural department.]\n* **Authorized Shops:** Buy medicines only from shops authorized to sell agricultural chemicals.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer\n- Buy medicines only from authorized shops\n- Follow all safety rules when using medicines\n- Ask for help if you're unsure about anything*\n",
    "label": "mold"
  },
  {
    "image_path": "test_images\\9820663405_934eaed214_b.jpg",
    "analysis": "**Advice for Farmers: Mango Anthracnose**\n\n**1. What is the Problem?**\n\nThe problem is **Mango Anthracnose**, a common disease that affects mangoes.  It looks like brown or black spots, sometimes sunken, appearing on the mango skin.  These spots can grow bigger and may even cause the fruit to rot.  The skin is mostly affected, but the disease can also damage the flesh inside if it's severe.\n\n**2. Why it Happened?**\n\nMango Anthracnose is caused by a fungus (a tiny plant that causes disease) that thrives in humid and rainy weather.  It spreads easily through rain splashes and wind.  You'll see it more often during the rainy season or when there's a lot of dew on the mangoes.  If you see many mangoes with these spots in your orchard, it's a sign of anthracnose.  Think of it like a cold spreading easily among people who are close together.\n\n**3. How to Fix It?**\n\n* **First:** Collect and destroy all affected mangoes.  Don't leave them on the ground or near healthy trees.  Burn them or bury them deep to prevent the fungus from spreading.\n* **Second:**  Clean your orchard. Remove any fallen leaves or dead branches, as the fungus can live in these.\n* **Third:** If the infection is widespread, consider treatment (see below).\n\n**4. How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Regularly check your mango trees for any signs of spots or discoloration on the fruits.\n* **Warning Signs:** Watch for humid weather and heavy rainfall. These conditions favor the fungus's growth.\n* **Prevention:**  Proper spacing of trees allows for better air circulation, reducing humidity.  Also, avoid overhead watering – water at the base of the tree to keep the leaves dry.\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  Copper oxychloride (available at most agricultural shops).  The cost varies depending on the quantity, but a small pack might cost around ₹50-₹150.  Always follow the instructions on the label carefully.  Mix the recommended amount with water and spray the trees thoroughly, covering all parts of the plant, especially the fruits.  *Note:  Always wear protective clothing (gloves, mask) when using chemical treatments.*\n\n* **Natural Treatment:**  A solution of baking soda (bicarbonate of soda) and water can sometimes help.  Mix 1 tablespoon of baking soda in 1 liter of water and spray on the affected areas.  This is a low-cost, environmentally friendly option but may not be as effective as chemical treatments for severe infections.\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Contact your local KVK for advice and information.  They can provide you with their location and contact details.\n* **Government Help:** Check with your local agricultural department for information on subsidies or assistance programs for purchasing agricultural medicines.\n* **Local Agriculture Officer:** Your local agriculture officer can help identify the problem and suggest the best course of action.  They can also tell you where to buy genuine medicines.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:**\n\n*This advice is to help you understand your plant's problem. For safety, please:\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.*\n",
    "label": "anthracnose"
  },
  {
    "image_path": "test_images\\apple-scab-apple-4.jpg",
    "analysis": "**Advice for Farmers: Apple Scab**\n\n**1. What is the Problem?**\n\nYour apple fruits have **Apple Scab**.  It looks like dark brown or black scabby spots on the skin of the apples.  These spots can be small or large and sometimes crack the skin.  The disease mostly affects the fruit, but it can also show up on the leaves as olive-green spots.\n\n**2. Why it Happened?**\n\nApple scab is caused by a fungus (a tiny plant that causes disease) that lives in the soil and on fallen leaves.  Rainy, humid weather helps the fungus spread.  If you had a wet spring or summer, and the orchard was poorly ventilated, this fungus could have easily spread.  You might also see the fungus growing on old, fallen apples.\n\n**3. How to Fix It?**\n\nFirst: **Remove and destroy** all affected apples and leaves.  Collect them and burn them, or bury them deep in the soil. This will reduce the number of fungus spores.\n\nSecond: **Improve air circulation** in your orchard.  Prune branches to allow better airflow and sunlight penetration. This will help to dry the leaves and fruits quickly, making it harder for the fungus to grow.\n\nThird:  If the infection is widespread, you may need to use a treatment (See section 5).\n\n\n**4. How to Prevent it Next Time?**\n\n* **Clean up:**  Collect and destroy all fallen leaves and fruits in autumn.  This removes the fungus's winter home.\n* **Pruning:** Prune your trees regularly to improve air circulation.\n* **Healthy trees:** Make sure your apple trees are healthy and strong.  Healthy trees are better able to fight off diseases.\n* **Watch the weather:** Be extra vigilant during periods of wet and humid weather.\n\n\n**5. Treatment Options:**\n\n* **Chemical Treatment:**  There are many fungicides available to control apple scab.  Ask your local agriculture officer for recommendations.  Always follow the instructions on the label carefully.  Examples include Captan, Mancozeb.  (Prices vary greatly depending on brand and quantity; expect to pay anywhere from ₹100-₹500 per kg or litre).\n\n* **Natural Treatment:**  Some farmers have success with a mixture of cow urine and water (1:10 ratio).  Spray this on the trees regularly, especially during wet periods.  This is a low-cost, eco-friendly option, but its effectiveness may vary.\n\n\n**Important Note:** Always wear protective clothing (gloves, mask, etc.) when using chemical treatments.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):**  [Find your local KVK's contact information online or through your local agricultural department].\n* **Government Help:**  Check with your local agricultural department for information on subsidies or assistance programs for purchasing agricultural inputs.\n* **Local Agriculture Officer:** [Find their contact information through your local government agricultural department].\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure you get genuine products.\n\n\n**Safety Note:**  This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "scab"
  },
  {
    "image_path": "test_images\\black-knot-disease.jpg",
    "analysis": "**Advice for Farmers: Dealing with Black Knot Disease**\n\n**1. What is the Problem?**\n\nThe problem shown in the image is **Black Knot disease**.  It's a fungal disease that mainly affects fruit trees like plums, cherries, and apricots.  It looks like dark, bumpy, black growths or knots on the branches of your trees. These knots can be small at first, but they grow bigger over time, making the branches look swollen and deformed.  The disease affects the branches of the tree, sometimes even the main trunk.\n\n**2. Why it Happened?**\n\nBlack Knot happens because of a fungus that infects the branches.  The fungus spores (tiny seeds of the fungus) spread easily through the air, especially during windy or rainy weather.  They enter the tree through wounds, like cuts from pruning or damage from insects.  Think of it like a tiny cut getting infected.  \n\nSigns you might see:  Small, slightly swollen areas on branches that turn dark brown or black over time. These swellings will gradually get bigger and harder.\n\n**3. How to Fix It?**\n\nFirst: **Prune infected branches.** Cut off the infected branches at least 10-15 cm below the knot.  Make clean cuts with sharp, disinfected pruning shears (clean the blades with rubbing alcohol between each cut).\n\nSecond: **Collect and destroy the pruned branches.** Don't leave them in your orchard. Burn them or bury them deeply to prevent the fungus from spreading.\n\nThird: **Monitor your trees regularly.** Check your trees every week, especially during the growing season, to catch new infections early.\n\n**4. How to Prevent it Next Time?**\n\n* **Proper pruning:** Prune your trees during the dormant season (winter) to avoid spreading the disease.  Make clean cuts and disinfect your tools.\n* **Wound care:** If your trees get damaged (e.g., from storms or insects), treat the wounds with a protective paste to prevent fungal infection.\n* **Good orchard hygiene:** Keep your orchard clean and free of fallen leaves and branches.  This reduces the number of places the fungus can survive.\n* **Choose resistant varieties:** If possible, plant tree varieties that are known to be resistant to Black Knot.\n\n**5. Treatment Options:**\n\nUnfortunately, once a tree has Black Knot, it's hard to completely cure it.  The best approach is to remove infected parts.  However, some fungicides can help prevent the spread:\n\n* **Copper-based fungicides:** These are relatively inexpensive (₹100-₹300 per litre, depending on the brand and concentration).  Follow the instructions on the label carefully.  *Note: Copper can be harmful to the environment if used excessively.*\n* **Natural remedies:** Some farmers use neem oil (₹150-₹300 per litre) as a preventative measure.  It's not a cure but may help reduce fungal growth.  Apply it according to the product instructions.\n\n**Important:** Always buy medicines from authorized agricultural supply stores.\n\n\n**6. Where to Get Help?**\n\n* **Krishi Vigyan Kendra (KVK):** Contact your local KVK for advice and information.  They can tell you the nearest KVK to your farm.\n* **Government schemes:** Inquire about government subsidies or programs that may help you buy necessary medicines or equipment.\n* **Local agriculture officer:** Your local agriculture officer can provide expert advice and guidance.  Ask your village head or local agricultural department for their contact information.\n* **Authorized shops:** Buy fungicides only from registered agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** *This advice is to help you understand your plant's problem. For safety, please: Show this information to your local agriculture officer, buy medicines only from authorized shops, follow all safety rules when using medicines, and ask for help if you're unsure about anything.*\n",
    "label": "unknown disease"
  },
  {
    "image_path": "uploads\\download.jpeg",
    "analysis": "**Mango Anthracnose: Simple Advice for Farmers**\n\n1. **What is the Problem?**\n\nThe mango has a disease called Anthracnose.  It looks like dark brown or black, sunken spots or patches on the mango fruit.  Sometimes these spots have a moldy look. The skin of the mango is affected, and the disease can rot the fruit inside.\n\n2. **Why it Happened?**\n\nAnthracnose is caused by a fungus that loves warm, humid weather.  It spreads easily when there's a lot of rain or dew on the mangoes.  You'll see it more often during the rainy season.  If you notice a lot of small, dark spots on the leaves and branches, that's another sign the fungus is present.  Think of it like a cold spreading easily when people are close together – the fungus spreads easily when mangoes are close and wet.\n\n3. **How to Fix It?**\n\n* **First:** Carefully remove and destroy (burn if possible) all affected mangoes. Don't leave them on the ground, as this will spread the fungus.\n* **Second:**  Clean the area around the mango tree. Remove any fallen leaves or fruit.  Good air circulation helps prevent the fungus from spreading.\n* **Third:**  If the infection is widespread, consider treatment (see below).\n\n4. **How to Prevent it Next Time?**\n\n* **Daily/Weekly:** Check your mango trees regularly for any signs of dark spots on the fruit, leaves, or branches.\n* **Warning Signs:** Look out for humid weather and heavy rains. These are perfect conditions for the fungus to grow.\n* **Prevention:** Ensure good air circulation around your mango trees by pruning branches that are too close together.\n\n5. **Treatment Options:**\n\n* **Chemical Treatment:**  Copper oxychloride (available at most agricultural shops).  The cost varies, but a small packet might cost around ₹50-₹150.  Always follow the instructions on the packet carefully.  **Note:**  Copper oxychloride is a broad-spectrum fungicide and should be used cautiously.  Overuse can harm beneficial insects and the environment.\n* **Natural Treatment:**  A solution of baking soda (sodium bicarbonate) and water can sometimes help. Mix 1 tablespoon of baking soda in 1 liter of water and spray on the leaves and fruits. This is a much cheaper option (₹10-₹20 for baking soda).  This is less effective than chemical treatments but safer for the environment.\n\n**Important:**  Always use protective gear (gloves and mask) when applying any chemical treatment.\n\n6. **Where to Get Help:**\n\n* **Krishi Vigyan Kendra (KVK):** Find your nearest KVK by searching online or asking at your local agricultural office.\n* **Government Help:**  Inquire at your local agricultural office about subsidies or assistance programs for purchasing agricultural chemicals.\n* **Local Agriculture Officer:**  Ask your village head or local agricultural extension worker for their contact details.\n* **Authorized Shops:** Buy medicines only from authorized agricultural input dealers to ensure quality and safety.\n\n\n**Safety Note:** This advice is to help you understand your plant's problem. For safety, please:\n\n- Show this information to your local agriculture officer.\n- Buy medicines only from authorized shops.\n- Follow all safety rules when using medicines.\n- Ask for help if you're unsure about anything.\n",
    "label": "unknown",
    "timestamp": "2025-04-02 09:21:57.118841"
  }
]